{
  "document_id": 1,
  "original_file_path": "D:\\SaXin\\SaXin-program\\文章总结工具\\backend\\uploads\\adb898a4-5ddc-400a-abc3-5c9f3159b463.pdf",
  "processed_text": "668 | Nature | Vol 640 | 17 April 2025\nArticleMetal–support frontier orbital interactions \nin single-atom catalysis\nXianxian Shi1,2,3 ,9, Zhilin Wen2,9, Qingqing Gu4,9, Long Jiao1,2, Hai-Long Jiang1,2, Haifeng Lv1, \nHengwei Wang1, Jiani Ding1,2, Mason P. Lyons5, Alvin Chang6, Zhenxing Feng5, Si Chen2, \nYue Lin1, Xiaoyan Xu4, Pengfei Du4, Wenlong Xu2, Mei Sun1, Yin Li2, Bing Yang4 ✉, Tao Zhang4, \nXiaojun Wu1,2,7 ✉ & Junling Lu1,2,8 ✉\nSingle-atom catalysts (SACs) with maximized metal use and discrete energy levels  \nhold promise for broad applications in heterogeneous catalysis, energy conversion, \nenvironmental science and biomedicine1–7. The activity and stability of SACs are \ngoverned by the pair of metal–adsorbate and metal–support interactions8–10. However, \nthe understanding of these interactions with their catalytic performance in nature  \nis challenging. Correlations of activity with the charge state of metal atoms have \nfrequently reached controversial conclusions11– 15. Here we report that the activity  \nof palladium (Pd1) SACs exhibits a linear scaling relationship with the positions of the \nlowest unoccupied molecular orbital (LUMO) of oxide supports across 14 types of \nsemiconductor. Elevation of the LUMO position by reducing the support particle size \nto a few nanometres boosts a record high activity along with excellent stability in the \nsemi-hydrogenation of acetylene. We show that the elevated LUMO of support reduces \nits energy gap with the highest occupied molecular orbital (HOMO) of Pd1 atoms, \nwhich promotes Pd1–support orbital hybridizations for high stability and further \namends the LUMO of anchored Pd1 atoms to enhance Pd1–adsorbate interactions for \nhigh activity. These findings are consistent with the frontier molecular orbital theory \nand provide a general descriptor for the rational selection of metal–support pairs with \npredictable activity.\nMetal–support interactions (MSIs) in single-atom catalysts (SACs) \noften induce substantial electronic perturbations to the metal16,17, the \nso-called electronic MSI (EMSI)18,19. The charge state of metal atoms \ninferred from X-ray photoelectron spectroscopy (XPS), X-ray absorption \nnear-edge structure and infrared vibrational spectroscopy has often \nbeen used to depict the strength of EMSI and to explain the catalytic \nactivity11,12,20–22. However, it leads to intensive debates on which charge \nstate of metal atoms is catalytically more active11– 15. Meanwhile, the char-\nacter of discrete energy structures of SACs also raises questions about \nthe d-band theory, which is widely adopted for metal nanoparticle cata -\nlysts with continuous energy band structures23. Alternatively, frontier \nmolecular orbital (FMO) theory, frequently applied to homogeneous \nmolecular catalysts24,25, has also been advocated to depict M1–adsorbate \norbital interactions in SACs8–10,26. However, the panoramic illustration of \nM1–support and M1–adsorbate orbital interactions in SACs has not yet \nbeen demonstrated either theoretically or experimentally to the best \nof our knowledge. Fundamental questions about the nature of these \ninteractions in single-atom catalysis remain unanswered.\nTo obtain a deep insight of these interactions, we synthesized 34 \nPd1 SACs across 14 types of semiconducting support, in which the size of supports was also tuned to further modulate their electronic band \nstructures (Fig. 1a). First, a series of semiconducting oxide particles \n(MOx = ZnO, CoOx, NiOx, TiO2 and Ga2O3 with varied sizes) were grown \non a spherical SiO2 substrate using atomic layer deposition (ALD) \nby varying the number of ALD cycles27 (Supplementary Figs. 1–6).  \nThese supports are denoted as MOx-y nm, where y  is the average size \nof oxide particles. Ultraviolet–visible (UV–Vis) spectroscopy and \nMott–Schottky plots measurements28,29 showed that the n-type bulk \nZnO has the lowest unoccupied molecular orbital (LUMO) position \nof −0.35 V (versus normal hydrogen electrode (NHE)), and a band gap \n(Eg) of 3.29 eV (Fig.  1b and Supplementary Figs. 7 and 8). As the size of \nZnO decreased from bulk (about 46 nm) to about 1.9 nm, the LUMO \nposition upshifted gradually to −1.12 V (versus NHE), and the band gap \nbecame considerably broader to 5.82 eV (Supplementary Figs. 9 and \n10), in good agreement with the literature28. Similar phenomena were \nalso observed for other MOx particles, regardless of whether they were \nn- or p-type semiconductors30 (Fig.  1b, Supplementary Figs. 11–20 and \nSupplementary Table 1). Therein, the upshift of LUMO positions is big \nfor p-type CoOx samples, but small for NiOx, TiO2 and Ga2O3 with the \nchange of particle size.https://doi.org/10.1038/s41586-025-08747-z\nReceived: 29 July 2022\nAccepted: 6 February 2025\nPublished online: 2 April 2025\n Check for updates\n1State Key Laboratory of Precision and Intelligent Chemistry, Hefei National Research Center for Physical Sciences at the Microscale, University of Science and Technology of China, Hefei, China. \n2School of Chemistry and Materials Science, iChem, University of Science and Technology of China, Hefei, China. 3College of Aerospace Science and Engineering, National University of Defense \nTechnology, Changsha, China. 4CAS Key Laboratory of Science and Technology on Applied Catalysis, Dalian Institute of Chemical Physics, Chinese Academy of Sciences, Dalian, China. 5School \nof Chemical, Biological, and Environmental Engineering, Oregon State University, Corvallis, OR, USA. 6School of Mechanical, Industrial, and Manufacturing Engineering, Oregon State University, \nCorvallis, OR, USA. 7Hefei National Laboratory, University of Science and Technology of China, Hefei, China. 8Suzhou Laboratory, Suzhou, China. 9These authors contributed equally: Xianxian Shi, \nZhilin Wen, Qingqing Gu. ✉e-mail: byang@dicp.ac.cn; xjwu@ustc.edu.cn; junling@ustc.edu.cn\nNature | Vol 640 | 17 April 2025 | 669Next, Pd1 atoms were selectively deposited on MOx particles using Pd \nALD to obtain a series of Pd1/MOx SACs, in which the selective deposi-\ntion was confirmed by inductively coupled plasma atomic emission \nspectroscopy (ICP–AES) analysis (Supplementary Fig. 21). Pd1 atoms \nwere also deposited on some bulk oxide supports (Pd1/MOx-bulk) \nfor comparison. The Pd loadings in Pd1/MOx were all close to 0.1 wt% \naccording to ICP–AES (Supplementary Table 2). Aberration-corrected \nhigh-angle annular dark-field scanning transmission electron microscopy (AC-HAADF-STEM) confirmed the atomic dispersion of \nPd without the presence of any visible clusters or nanoparticles in all \nthese samples (Fig. 1c–e and Supplementary Figs. 22–26). DRIFTS of \nCO chemisorption also showed that all Pd1/MOx-y nm samples exhib -\nited a single peak at 2,080–2,096 cm−1, assigned to linear CO on Pd1 \natoms31 (Fig.  1f), but with the absence of bridge-bonded CO (about \n1,900–2,000 cm−1), further validating the atomic dispersion of Pd. \nWe observed blueshifts of CO peak by a few wavenumbers in all sets \n6420\n1 10 450 60030–3Potential (V versus NHE)ZnO\nTiO2\nGa2O3\np-Typen-Type\nOxide size (nm)CoOx\nNiOxb\n344 336 328 320\nBinding energy (eV)336.1\n335.6336.2\n337.4338.3337.5\n336.8337.8\n×2.0\n×0.3\n×0.5×0.5×2/3Pd 3d\n337.5336.5\n2,200 2,100 2,000 1,900 1,800×2\n×0.3ZnO-bulkZnO-bulkZnO-1.9 nm ZnO-1.9 nmPd1/MOx Pd1/MOxIntensity (a.u.)\nIntensity (a.u.)\nWavenumber (cm–1)2,094\n2,090\n2,0802,089\n2,0872,0962,0902,096\n2,0902,094ZnO-8.5 nm ZnO-8.5 nm\nCoOx-1.4 nm\nNiOx-1.8 nm\nNiOx-7.1 nmCoOx-3.5 nm\nCoOx-bulkCoOx-1.4 nm\nCoOx-3.5 nm\nCoOx-bulk\nNiOx-bulkNiOx-1.8 nm\nNiOx-7.1 nm\nNiOx-bulkGa2O3-1.3 nm\nGa2O3-/f_ilmGa2O3-1.3 nm\nGa2O3-/f_ilmTiO2-/f_ilmTiO2-1.6 nm\nTiO2-/f_ilmTiO2-1.6 nm\n×0.5\n×2\n×2f ga\nEnergyVersusWeak coupling\nPd1 Pd1/MOx-bulk MOx-bulk Pd1/MOx-NPs MOx-NPsStrong coupling\nStrong EMSI Weak EMSIReduce oxide size\nQuantum effect\n/uni0394E\nLUMOLUMOe–e–HOMO\ndc\nePd1/uni0394E/uni2032HOMO\nFig. 1 | Variation of EMSIs in Pd1/MOx SACs on support particle size.  \na, Schematic of tailoring EMSIs in Pd1/MOx SACs by changing the energy band \nstructures of oxide supports by size variation. b , Energy-level diagrams of  \nn- and p-type metal oxides with different particle sizes as determined by TEM, \nUV–Vis and Mott–Schottky plots. Here the size of the spherical SiO2 substrate \nwas used to represent the size of the TiO2 and Ga2O3 films grown on top. Error \nbars represent the standard deviations of oxide particle size as determined by TEM. c–e, Representative AC-HAADF-STEM images of Pd1/ZnO-1.9 nm ( c),  \nPd1/ZnO-8.5 nm ( d) and Pd1/ZnO-bulk ( e). The white circles in c –e highlight Pd1 \nsingle atoms on ZnO. f ,g, In situ DRIFTS CO chemisorption ( f) and in situ XPS \nspectra ( g) in the Pd 3 d region of Pd1/MOx SACs. All samples were pre-reduced \nat 100 °C for 30 min with 10 vol% H2/Ar before CO chemisorption and XPS \nmeasurements without exposure to air. Scale bars, 2 nm ( c,e); 5 nm ( d).\n670 | Nature | Vol 640 | 17 April 2025\nArticleof Pd1 SACs as the size of oxide supports decreased, suggesting that \nPd1 atoms on nanosized oxide particles were more electron deficient, \nweakening the Pd(4d)–CO(2π*) bonding through π back-donation32. \nIn situ XPS also demonstrated the shifts of Pd 3d  peak to higher binding \nenergies by about 0.3–0.9 eV across all sets of samples (Fig.  1g), con -\nfirming the increased electron deficiency of Pd1 atoms. UV–Vis spectra \nalso disclosed more significant changes of the ZnO band structures in \nPd1/ZnO-1.9 nm and Pd1/ZnO-2.8 nm than that in Pd1/ZnO-bulk by Pd \ndeposition (Supplementary Fig. 27). Consequently, the above results \nall indicate the greatly enhanced orbital hybridizations between Pd1 \nand nanosized oxide particles.\nThe semi-hydrogenation of acetylene in excess ethylene, an indus -\ntrial process for purifying alkene streams33, was used as a probe reac-\ntion to evaluate their performance. We found that at a high acetylene \nconversion of 90%, the ethylene selectivity of these catalysts all \nremained above 90%, except for slightly lower ethylene selectivity on \nPd1/Ga2O3-film and Pd1/TiO2-film (Supplementary Figs. 28–32). How -\never, the intrinsic activity in terms of turnover frequencies (TOFs) per \nPd atom increased substantially as the oxide particle size decreased \n(Fig.  2a). For the set of Pd1/ZnO-y  nm SACs, the TOF was approximately \n25.6 min−1 for Pd1/ZnO-1.9 nm at 80 °C, far superior to the conventional \nPd1/ZnO-bulk catalyst (1.0 min−1) (Supplementary Fig. 28). A tremen -\ndous activity enhancement was also observed for Pd1/CoOx-y nm with \nthe TOFs increased dramatically from 1.0 min−1 to 22.6 min−1 (Supple-\nmentary Fig. 29), whereas the sets of Pd1/NiOx, Pd1/Ga2O3 and Pd1/TiO2 \ncatalysts showed relatively smaller activity enhancements (Supple -\nmentary Figs. 30–32).\nKinetic studies showed that the apparent reaction barriers (Ea) \ndecreased considerably for all sets of Pd1 SACs as the oxide particle \nsize decreased (Supplementary Fig. 33), verifying the remarkable activ -\nity improvement. It is worth noting that the activity of Pd1/ZnO-1.9 nm \nis far superior to those Pd1 SACs reported in the literature34,35 and in \nparticular approximately 46 times greater than the benchmark Pd1Ag/\nSiO2 single-atom alloy catalyst35 (Fig.  2b and Supplementary Table 3). \nMore importantly, Pd1/ZnO-1.9 nm also exhibited excellent stability \nwithout any noticeable decrease in either activity or selectivity for at \nleast 100 h (Fig.  2c). By contrast, Pd1/ZnO-8.5 nm and Pd1/ZnO-bulk \nboth deactivated rapidly along with a continuous decrease in ethylene \nselectivity. HAADF-STEM imaging showed that Pd atoms remained \natomically dispersed in the used Pd1/ZnO-1.9 nm and Pd1/ZnO-8.5 nm \ncatalysts after the long-term reaction, whereas severe aggregations \noccurred in the used Pd1/ZnO-bulk catalyst (Supplementary Fig. 34). \nIn situ thermogravimetric analysis under hydrogenation conditions \nshowed that coke deposition, another key factor of catalyst deactiva-\ntion33, was also negligible on Pd1/ZnO-1.9 nm, but substantially on Pd1/\nZnO-8.5 nm and Pd1/ZnO-bulk (Supplementary Fig. 35). Pd1/ZnO-1.9 nm \nalso showed enhanced activity and long-term stability in the selective \nhydrogenation of 1,3-butadiene (Supplementary Fig. 36), rendering \nthis material promising for a wide range of selective hydrogenation \nreactions.\nCorrelation of the intrinsic activities with the properties of Pd1 dis-\ncloses that the activities of Pd1/MOx SACs showed a tight linear correla -\ntion with the Pd charge states in each series of samples (Fig.  2d), in line \nwith the literature11,12,22. However, this relation failed when the activi -\nties of all sets of samples were compared. By contrast, their activities \nshowed a linear scaling relationship with the LUMO positions of the n- \nand p-type oxide particle supports in Pd1/MOx (Fig.  2e,f ). To confirm the \nabove linear scaling, 16 more Pd1 SACs on various bulk semiconducting \nsupports (n-type: ZrO2, ZnAlxOy, SrTiO3, Fe3O4, Fe2O3 and MgAlxOy with \ndifferent Al to Mg ratios, and InOx with varied sizes; and p-type: Cu2O \nand CuO) were further synthesized and evaluated (Supplementary \nFigs. 37–46). Their activities were again in a good fit of the above linear \nscaling, implying the essential role of the LUMO positions of oxide \nparticles in governing the activity of Pd1 SACs (Fig.  2e, f and Supplemen -\ntary Figs. 42–46). This result is in line with the observation of a linear correlation between the C–H activation energy and the surface reduc -\nibility of metal oxides in ref. 36 , because the oxygen vacancy formation \nenergy is probably associated with the LUMO position of oxide28,29. \nHere, compared with that for the p-type ones, a steeper slope for the \nn-type samples, along with relatively larger deviations from the fittings \nis noticed, which is probably caused by the perturbations from impurity \nenergy levels that are close to the LUMOs of n-type semiconductors30. \nWe also measured the LUMO positions of several representative sup -\nports using ultraviolet photoelectron spectroscopy (Supplementary \nFig. 47 and Supplementary Table 4) and UV–Vis (Supplementary Figs. 9, \n42–44). It again showed a similar linear scaling relationship, validating \nthe above results (Supplementary Figs. 48 and 49 and Supplementary \nTables 5 and 6).\nH2 activation is a crucial step in SAC-catalysed hydrogenation reac-\ntions11. We demonstrated that as the oxide particle size decreased, \nthe H–D exchange rates over these Pd1 SACs also increased greatly in \nthe H–D exchange reaction (Fig.  3a), which was further confirmed by \nkinetic measurements (Supplementary Fig. 50). These results indicate \nthat the drastic improvement in hydrogenation activity in Fig.  2a can \nbe attributed to the facilitation of H2 activation. More interestingly, \na linear scaling relationship between the LUMO positions of either \nn- or p-type oxide supports and the activities of Pd1 SACs was again \nestablished (Fig.  3b).\nTemperature-programmed desorption (TPD) of H2 on selected Pd1/\nZnO-y nm showed that there were two H2 desorption peaks located at \n46 °C and 362 °C for Pd1/ZnO-bulk (Fig.  3c), assigned to chemisorbed \nH2 on Pd1 atoms and spillover H2 on the ZnO support, respectively37; \nthe latter case is further confirmed by the observation of noticeable \nsurface hydroxyls formation after H2 exposure using in situ XPS (Sup -\nplementary Fig. 51). As the size of ZnO decreased, the H2 desorption \npeak from Pd1 atoms gradually shifted to 87 °C. Meanwhile, the C2H2 \ndesorption temperature also shifted from 52 °C to 109 °C accordingly \n(Fig.  3d). Here the increased H2 desorption temperature remained lower \nthan that of C2H2, which is consistent with the decreased H2 reaction \norder and negative C2H2 reaction order on Pd1/ZnO-1.9 nm (Supple -\nmentary Fig. 52). The reduction of the underlying ZnO particle size to \na few nanometres endows the Pd1 atoms to be more electron deficient \n(Fig.  1f,g), which in turn enhances the adsorption of H2 and C2H2 on \nPd. Moreover, we also noticed that the peak area of C2H2 desorption \non Pd1/ZnO-1.9 nm became substantially larger owing to additional \nC2H2 adsorption on support (Supplementary Fig. 53). Nonetheless, \nZnO-1.9 nm itself was inactive, and the H2 spillover effect on activity \nwas trivial (Supplementary Fig. 54).\nTo understand the linear scaling relationship as well as improved \nstability, density functional theory (DFT) calculations were further \nperformed on the Pd1/ZnO system, in which ZnO slab and clusters with \ndifferent numbers of units (ZnO- x, where x  is the number of units) and \nall nonpolar (10 10) surface exposed were calculated to represent the \nZnO bulk and particles with different sizes. Calculations using the \nPerdew–Burke–Ernzerhof (PBE) exchange-correlation functional show \nthat the HOMO position of freestanding Pd1 atom is located at −4.08 eV \n(Fig.  4a), whereas the LUMO and HOMO of ZnO slab are located at \n−5.46 eV and −5.68 eV, respectively (Supplementary Fig. 55). As ZnO \nparticle size is reduced to ZnO-30, the LUMOs sharply climb to −4.32 eV, \nwhereas their HOMOs decline, which together broaden the band gap, \nconsistent with the experimental results (Fig. 1b ). It is worth noting \nthat the PBE functional might have considerably underestimated the \nband gap, although the trend of changes in the LUMO positions can be \nreliable and further corroborated by calculations using a high-level \nscreened hybrid Heyd–Scuseria–Ernzerhof (HSE06) functional (Sup -\nplementary Table 7). The reduction of ZnO particle size largely narrows \nthe energy gap between the LUMO of ZnO and the HOMO of freestand -\ning Pd atom. According to the FMO theory24,25, this would substantially \nintensify orbital couplings between these two to lead to a high stability \n(Fig.  1a).\nNature | Vol 640 | 17 April 2025 | 671The optimized structures of Pd1 on ZnO show preferential anchor-\ning of Pd1 atoms at Zn vacancies with three Pd–O coordinations (Sup -\nplementary Fig. 56 and Supplementary Table 8), evidenced by X-ray absorption spectroscopy (Supplementary Fig. 57 and Supplemen -\ntary Table 9) and high-resolution HAADF-STEM measurements \n(Supplementary Fig. 22). The adsorption of Pd1 on nanosized ZnO is \nPd1/ZnO-y nm\nPd1Au/SiO2\nPd1Ag/SiO2\nPd1Cu/SiO2\nPd1Ag/SiO2\nPd1/C3N4Pd1In/MgAl2O4Pd1Cu/Al2O3Pd1/Ni(OH)2\nPd1/ND@G\nPd1/ZnO-bulkPd1/ZnO-1.9 nm\nPd1/ZnO-1.9 nm\nPd1/ZnO-8.5 nm\nPd1/ZnO-bulkPd1/CoOx-1.4 nm\nPd1/N-graphenePd1/non-MPNCPd1/MPNC\nPd1/CN\nPd1/CoOx-y nm\nPd1/NiOx-y nm\nPd1/CuOPd1/Cu2ORatiof of H2 to acetylenePd1/TiO2-y nm\nPd1/Ga2O3-y nm\nPd1/CoOx-y nm\nPd1/NiOx-y nm\nPd1/ZnO-y nm\nPd1/ZnO-y nm\nPd1/TiO2-y nm\nPd1/ZrO2Pd1/Ga2O3-y nm\nPd1/InOx-y nm\nPd1/MgAlxOy\nPd1/ZnAlxOy\nPd1/SrTiO3\nPd1/Fe3O4\nPd1/Fe2O3Pd1/TiO2-y nm\nPd1/Ga2O3-y nm\nPd1/CoOx-y nm\nPd1/NiOx-y nm28a\nc\neb30\n20\n10\n0\n20 15 10 5 021TOF (min–1) Conversion (%) Selectivity (%)\nTOF (min–1)\nd\nf30\n20\n10\n0\n24\n16\n8\n0\n–3 –1.4 –1.2 –1.0 –0.8 –0.6 –0.4 –0.2 –2 –1 0TOF (min–1) TOF (min–1)24\n16\n8\n0TOF (min–1)Size of oxide particle support (nm)14\n7\n0\n100\n50\n100\n50\n0\n0 20 40\nTime (h) Binding energy (eV)\nLUMO position (V) LUMO position (V)60 80 100 336 337 3381.9 1.6 2.84.38.5Bulk1.41.61.92.63.5Bulk1.87.1Bulk Film 1.3Film\nFig. 2 | Catalytic performance of Pd1/MOx catalysts.  a, Intrinsic activities of \nPd1/MOx catalysts at 80 °C in the semi-hydrogenation of acetylene in excess \nethylene. b, Comparison of the activities of Pd1/ZnO-1.9 nm and Pd1/CoOx-1.4 nm \nwith those of conventional Pd-based SACs reported in the literature at 80 °C.  \nc, Acetylene conversion and ethylene selectivity as a function of time during \nlong-term stability tests of Pd1/ZnO-1.9 nm, Pd1/ZnO-8.5 nm and Pd1/ZnO-bulk. d, The correlation between the TOFs of Pd/MOx catalysts in acetylene \nhydrogenation at 80 °C and the Pd 3 d5/2 binding energy of Pd1 atoms as \ndetermined by in situ XPS. e ,f, Linear scaling relationships between the \nactivities of Pd1/MOx catalysts and the LUMO positions of n-type ( e) and p-type \n(f) oxide supports. Reaction conditions: 1 vol% acetylene, 2 vol% H2 and 50 vol% \nethylene balanced in Ar; flow rate = 20 ml min−1; and pressure = 0.1 MPa.\n672 | Nature | Vol 640 | 17 April 2025\nArticleconsiderably stronger than on ZnO-slab (Supplementary Table 10). \nCharge density difference analysis further illustrates markedly stronger \norbital couplings along with greater charge transfer from Pd1 atom to \nnanosized ZnO in Pd1/ZnO-x (Fig.  4a (inset) and Supplementary Figs. 58 \nand 59), consistent with the DRIFTS CO chemisorption and XPS results \n(Fig.  1f,g ). These results verify the high stability of Pd1/ZnO-1.9 nm. \nWhen electrons are transferred from Pd to ZnO, the original HOMO of \nfreestanding Pd1 atoms becomes an unoccupied or partially occupied \nstate (or LUMO) of anchored Pd1 atoms in Pd1/ZnO. Therefore, inten -\nsifying Pd1–ZnO orbital coupling would enhance charge transfer and \ncause a greater downshift and broadening of Pd energy levels (Sup -\nplementary Fig. 60 and Supplementary Note), which in turn leads to \nthe lowering of the LUMO position of anchored Pd1 atoms. Deconvo -\nluted partial density of states (PDOS) analysis demonstrates this \ngradual decline for Pd1/ZnO-x  (mainly contributed by the dxy−22  orbit -\nals of Pd) with the reduction of ZnO particle size (Fig.  4b and Supple-\nmentary Fig. 61), analogous to the ligand effect in homogeneous \ncatalysts38.\nRegarding the M1-adsorbate orbital interactions, we show that the \nlowered LUMO of Pd1 atoms on nanosized ZnO exhibits smaller energy gaps with the HOMOs of C2H2 (mainly contributed by the py and px \norbitals of C2H2) and H2 molecules (Fig. 4c ), which could reinforce \nthe Pd1–adsorbate orbital overlapping and enhance their adsorption \naccording to the FMO theory24,25 (Fig.  4c). As the ZnO particle size \ndecreases from ZnO-slab to ZnO-30, the adsorption energies of H2 \nand C2H2 on Pd1 increase substantially from 0.30 eV to −0.84 eV and \nfrom −0.38 eV to −1.61 eV, respectively (Fig. 4d), in line with the TPD \nresults (Fig.  3c,d).\nNext, we calculated the energy profiles for H2 activation and C2H2 \nhydrogenation on Pd1/ZnO-52 (the size of ZnO-52 is close to that in Pd1/\nZnO-1.9 nm) and Pd1/ZnO-slab. We demonstrate that compared with \nPd1/ZnO-slab, Pd1 in Pd1/ZnO-52 draws more electrons from the bond-\ning orbitals of H2 molecule owing to the increased electron deficiency \n(Supplementary Fig. 62), which enhances its adsorption (−0.43 eV) \nand facilitates sequential H–H bond activation (energy barrier of \n0.46 eV versus 1.03 eV; Supplementary Fig. 63), consistent with the \nH–D exchange results (Fig. 3a). In C2H2 hydrogenation (Fig. 4e, Sup -\nplementary Fig. 64 and Supplementary Tables 11 and 12), we show \nthat on Pd1/ZnO-52, C2H2 first adsorbs on the Pd1 atom (Fig. 4e, i, ii). \nThen, H2 approaches the Pd1 and dissociates heterolytically with a low 100 200 300\n109\n89Intensity (a.u.)\n5293100\n0 100 200 300 400 500\nPd1/ZnO-1.9 nmPd1/ZnO-1.9 nm\nPd1/ZnO-2.8 nmPd1/ZnO-2.8 nm\nPd1/ZnO-4.3 nmPd1/ZnO-4.3 nm\nPd1/ZnO-8.5 nmPd1/ZnO-8.5 nm\nPd1/ZnO-bulkPd1/ZnO-bulk360Intensity (a.u.)\nTemperature (°C) Temperature (°C)465787\n362353\n352\n361\n75\n67–3 –2 –1 00102030\nLUMO position (V)n-Type p-Type\n07142128\nPd1/ZnO-y nm\nPd1/TiO2-y nm\nPd1/Ga2O3-y nm\nPd1/CoOx-y nm\nPd1/NiOx-y nm\nPd1/ZnO-y nm\nPd1/TiO2-y nm\nPd1/Ga2O3-y nm\nPd1/CoOx-y nm\nPd1/NiOx-y nmH–D exchange TOF (s–1)\nH–D exchange TOF (s–1)\n8.5Bulk1.4 3.5 1.87.1 1.6Film\nSize of oxide particle support (nm) 1.3Film Bulk Bulk1.92.84.3 2.6 1.61.9a b\nc d\nFig. 3 | Chemical properties of Pd1/MOx SACs.  a, The H–D exchange rates of Pd1/MOx SACs at 80 °C. b , Linear scaling relationships between the H–D exchange \nactivity and the LUMO positions of n- and p-type semiconducting oxide supports. c ,d, TPD curves of H2 (c) and acetylene ( d) over various Pd1/ZnO- y nm catalysts.\nNature | Vol 640 | 17 April 2025 | 673\n0\n–2\n–4\n–6\n–8\n–10\n–12 Energy (eV)Pd1\n dxy\ndxzdyz\ndz2\ndx2–y230 52 80 104 144 slab–4.0\n0\n–4\n–8\n–12\nC2H2\nPd1/ZnO-30Pd1H2\nPd1/ZnO-52\nPd1/ZnO-52Pd1/ZnO-144\nPd1/ZnO-slab\nPd1/ZnO-52\nPd1/ZnO-144\nPd1/ZnO-slab–4.5\n–5.0\n–5.5\n–6.0 LUMO of ZnO particles Energy versus vacuum (eV)\nEnergy versus vacuum (eV)\nN (number of ZnO units)HOMO of Pd atom\n–1.6\n–1.2\n–0.8\n–0.4\n0\n0.4/uni0394Gads (eV)H2  \nC2H2\nC2H2\nC2H2*\nC2H3* hydrogenationC2H4* hydrogenationC2H2\nC2H2-HOMODOS (states per eV)b\nc d\nea\n/uni0394E\nPd1/ZnO-52 Pd1/ZnO-slab\nPd1-LUMO\nC2H2@Pd1/ZnO-52 py\npz\npx \n \nH2* dissociationH\n2* dissociation\n0.34 eV/–0.18 eV\n0.34 eV/0.14 eV1.04 eV/–0.5 eV0.41 eV/–0.79 eV\n0.47 eV/–0.56 eV1.31 eV/0.28 eV\nC2H2* hydrogenationC2H5* hydrogenation0 eV/\n–0.20 eV\n(iv)\n(v)(ix)(ii)\n \n(x)Pd1/ZnO-30\n(i)\nC2H2\nadsorption\nC2H2\nadsorptionC2H4\ndesorptionH2 adsorption\nH2\nadsorption0 eV/–0.20 eV\n0.70 eV/–0.96 eV\nC2H4* + H2*\nC2H3* + H*C2H2* + 2H*C2H4* + 2H*C2H2* + H2*\nC2H5* + H*\nC2H4*(viii)(iii)\nC2H6(vii)\n(vi)\nFig. 4 | Theoretical insight into orbital coupling on activity in Pd1/ZnO \nSACs.  a, Calculated LUMO positions of ZnO particles with different sizes (red \nhorizontal solid line) and the HOMO of unsupported Pd1 atom (blue dashed \nhorizontal line) relative to vacuum. Shiny brown arrows highlight the energy \ndiscrepancies (Δ E) between the ZnO LUMOs and the Pd1 HOMO. The insets in a \nshow the charge density difference of Pd1 atoms in Pd1/ZnO-52 and Pd1/ZnO-\nslab, in which the yellow and cyan regions represent electron accumulation and \nelectron depletion, respectively. The isosurface value is 0.002 e Bohr−1 (ref.  3).  \nb, PDOSs of unsupported and ZnO- x-supported Pd1 with varying ZnO sizes.  \nThe PDOSs of C2H2 and H2 in the gas state are also given here for comparison. The red and brown horizontal dashed lines indicate the LUMOs of unsupported \nand ZnO- x-supported Pd1 and the HOMOs of C2H2 and H2, respectively. c , PDOS \nanalysis of orbital interactions between Pd1/ZnO-52 and C2H2 molecule before \nand after adsorption. d, Calculated adsorption free energies of H2 and C2H2  \non Pd1/ZnO- x with different ZnO particle sizes. e , Calculated Gibbs free energy \nprofiles of selective hydrogenation of acetylene on Pd1/ZnO-52. The structures \nof the key steps and intermediates are shown, as well as the energy barriers  \n(left of the slash) and reaction free energies (right of the slash) between the \ncorresponding key steps. Here, Pd, O, C, H and Zn atoms are in cyan, red, grey, \nwhite and silver, respectively.\n674 | Nature | Vol 640 | 17 April 2025\nArticlebarrier of 0.41 eV (Fig.  4e, iii →  iv). In the following, the two H* (asterisk \ndenotes surface species) sequentially attack C2H2* to form C2H4*, with \nbarriers of only 0.47 eV and 0.35 eV, respectively (Fig.  4e, iv →  vi). Next, \nC2H4* desorbs easily with a low barrier of 0.34 eV with the assistance of \ncompetitive C2H2 adsorption (Supplementary Fig. 65), evidenced by \nthe slight increase in the C2H2 reaction order after introducing ethylene \nto the reaction gas (Supplementary Fig. 52). Here the first addition of \nH* to C2H2* to form C2H3* is the rate-limiting step. Further hydrogena-\ntion of C2H4* to C2H6* is highly unfavourable, with a considerably high \nbarrier of 1.31 eV (Fig.  4e, vii →  x). For Pd1/ZnO-slab, the hydrogenation \nof C2H2 becomes considerably laborious (Supplementary Figs. 64, 66 \nand 67), in which the H* attack of C2H2* to form C2H3* has a barrier as \nhigh as 0.84 eV. Microkinetic simulations further confirmed the much \ngreater activity of Pd1/ZnO-52 than of Pd1/ZnO-slab (Supplementary \nFig. 68), agreeing well with the experimental results (Fig. 2a). Here, \nthe improved activity is mainly attributed to the greatly enhanced  \nH2 adsorption and activation (Fig.  2b, Supplementary Fig. 69 and  \nSupplementary Table 13).\nNotably, the variations in the Pd coordination structures (for exam -\nple, Pd–O bond lengths and O–Pd–O bond angles), which are due to \nvariations in the ZnO facet orientations and anchoring sites on the \nZnO clusters, do not alter the above result (Supplementary Figs. 70 \nand 71 and Supplementary Tables 14 and 15). Hydroxyls and oxygen \nvacancies might also be present on ZnO surfaces but have a minor \neffect on the activity (Supplementary Figs. 72–75 and Supplementary \nTables 16–20).\nCalculations were also carried out on the Pd1/Ga2O3 and Pd1/Co3O4 \nsystems. We show that the variation of Ga2O3 size upshifts only its \nLUMO position slightly from −5.23 eV to −4.90 eV (Δ(LUMO) = 0.33 eV), \nwhich causes minor changes in the adsorption of adsorbates on \nvarious Pd1/Ga2O3 (Supplementary Figs. 76 and 77 and Supplemen -\ntary Tables 21 and 22). By contrast, the upshift of the Co3O4 LUMO \nis relatively large (Δ(LUMO) = 0.78 eV), close to the change in the \nZnO LUMO (Δ(LUMO) = 1.14 eV) as its size decreases from the bulk \nto a Co11O13 cluster, which further leads to considerably enhanced \nadsorption of adsorbates on Pd1/Co11O13 (Supplementary Figs. 78 \nand 79 and Supplementary Tables 23 and 24). These calculation \nresults agree well with the small activity improvement on the set \nof Pd1/Ga2O3-y nm SACs but large improvement on Pd1/CoOx-y nm \n(Fig.  2a), again unambiguously verifying the essential roles of \nthe LUMO positions of semiconducting supports in single-atom  \ncatalysis.\nFinally, to gain insight into the failure in the correlation of the activi-\nties with the Pd charge states across various supports (Fig.  2d), we \nfurther calculated the average ionicity of Pd–O bonds on several oxide \nsupports according to natural bond orbital analysis39. We show that the \nionicities of Pd–O bonds in average for Pd1/ZnO-52 and Pd1/ZnO-slab are \nrather close to each other, approximately 64.1% and 67.3%, respectively, \nbut change substantially from one oxide to another, approximately \n81.1%, 66.2%, 52.1%, 75.6%, 67.2% and 71.7% for Co3O4, TiO2, Ga2O3, NiO, \nCuO and ZrO2, respectively (Supplementary Fig. 80 and Supplemen -\ntary Table 25). It demonstrates that ionic and covalent bonding are \ncapricious with the type of support, in line with the literature16, thus \nexcluding the charge states of metal atom as a unified descriptor for the \nactivity of SACs across various supports. In line with this observation, \nboth experiments and theory demonstrate that although the higher \ncharge state of Pd1 atoms in Pd1/Ga2O3 than that of Pd1/ZnO-1.9 nm \n(Figs. 1f,g, Supplementary Fig. 81 and Supplementary Table 26), Pd1/\nGa2O3 shows a considerably lower activity (Figs. 2d and 3a and Sup -\nplementary Figs. 50 and 82).\nIn summary, the identification of the measurable LUMO positions \nof both n- and p-type semiconducting supports as a universal descrip -\ntor for the predictable activity and stability of SACs substantiates the \nFMO theory experimentally. More importantly, these findings also \nopen a new avenue with high practicability for screening proper metal–support pairs for high activity and stability, particularly when \npowered by artificial intelligence40.\nOnline content\nAny methods, additional references, Nature Portfolio reporting summa -\nries, source data, extended data, supplementary information, acknowl -\nedgements, peer review information; details of author contributions \nand competing interests; and statements of data and code availability \nare available at https://doi.org/10.1038/s41586-025-08747-z.\n1. Wang, A., Li, J. & Zhang, T. Heterogeneous single-atom catalysis. Nat. Rev. Chem. 2, 65–81 \n(2018).\n2. Kaiser, S. K. et al. Single-atom catalysts across the periodic table. Chem. Rev. 120,  \n11703–11809 (2020).\n3. Hulva, J. et al. Unraveling CO adsorption on model single-atom catalysts. Science 371, \n375–379 (2021).\n4. Flytzani-Stephanopoulos, M. Gold atoms stabilized on various supports catalyze the \nwater–gas shift reaction. Acc. Chem. Res. 47, 783–792 (2014).\n5. Beniya, A. & Higashi, S. Towards dense single-atom catalysts for future automotive \napplications. Nat. Catal. 2, 590–602 (2019).\n6. Wang, C.-M., Wang, Y.-D., Ge, J.-W. & Xie, Z.-K. Reaction: industrial perspective on single-\natom catalysis. Chem 5, 2736–2737 (2019).\n7. Xiang, H., Feng, W. & Chen, Y. Single‐ atom catalysts in catalytic biomedicine. Adv. Mater.  \n32, 1905994 (2020).\n8. Li, S. et al. Interplay between the spin-selection rule and frontier orbital theory in O2 \nactivation and CO oxidation by single-atom-sized catalysts on TiO2(110). Phys. Chem. \nChem. Phys. 18, 24872–24879 (2016).\n9. Fu, Z., Yang, B. & Wu, R. Understanding the activity of single-atom catalysis from frontier \norbitals. Phys. Rev. Lett. 125, 156001 (2020).\n10. Spivey, T. D. & Holewinski, A. Selective interactions between free-atom-like d-states in \nsingle-atom alloy catalysts and near-frontier molecular orbitals. J. Am. Chem. Soc. 143, \n11897–11902 (2021).\n11. Ren, Y. et al. Unraveling the coordination structure-performance relationship in Pt1/Fe2O3 \nsingle-atom catalyst. Nat. Commun. 10, 4500 (2019).\n12. Wang, L. et al. Boosting activity and stability of metal single-atom catalysts via regulation of \ncoordination number and local composition. J. Am. Chem. Soc. 143, 18854–18858 (2021).\n13. Wang, Y. et al. CO oxidation on Au/TiO2: condition-dependent active sites and mechanistic \npathways. J. Am. Chem. Soc. 138, 10467–10476 (2016).\n14. Zhou, X. et al. Unraveling charge state of supported Au single-atoms during CO oxidation. \nJ. Am. Chem. Soc. 140, 554–557 (2018).\n15. Camellone, M. F. & Fabris, S. Reaction mechanisms for the CO oxidation on Au/CeO2 \ncatalysts: activity of substitutional Au3+/Au+ cations and deactivation of supported Au+ \nadatoms. J. Am. Chem. Soc. 131, 10473–10483 (2009).\n16. Lang, R. et al. Single-atom catalysts based on the metal–oxide interaction. Chem. Rev.  \n120, 11986–12043 (2020).\n17. O’Connor, N. J., Jonayat, A. S. M., Janik, M. J. & Senftle, T. P. Interaction trends between \nsingle metal atoms and oxide supports identified with density functional theory and \nstatistical learning. Nat. Catal. 1, 531–539 (2018).\n18. Campbell, C. T. Electronic perturbations. Nat. Chem. 4, 597–598 (2012).\n19. Bruix, A. et al. A new type of strong metal–support interaction and the production of H2 \nthrough the transformation of water on Pt/CeO2(111) and Pt/CeOx/TiO2(110) catalysts.  \nJ. Am. Chem. Soc.  134, 8968–8974 (2012).\n20. Yang, J., Li, W., Wang, D. & Li, Y. Electronic metal–support interaction of single‐ atom \ncatalysts and applications in electrocatalysis. Adv. Mater. 32, 2003300 (2020).\n21. Chen, C. et al. Zero‐ valent palladium single‐ atoms catalysts confined in black phosphorus \nfor efficient semi‐ hydrogenation. Adv. Mater. 33, 2008471 (2021).\n22. Chen, Z. et al. Single-atom heterogeneous catalysts based on distinct carbon nitride \nscaffolds. Natl Sci. Rev. 5, 642–652 (2018).\n23. Hammer, B., Morikawa, Y. & Nørskov, J. K. CO chemisorption at metal surfaces and \noverlayers. Phys. Rev. Lett. 76, 2141–2144 (1996).\n24. Houk, K. N. Frontier molecular orbital theory of cycloaddition reactions. Acc. Chem. Res.  \n8, 361–369 (1975).\n25. Fukui, K. The role of frontier orbitals in chemical reactions (Nobel Lecture). Angew. Chem. \nInt. Ed. 21, 801–809 (1982).\n26. Greiner, M. T. et al. Free-atom-like d  states in single-atom alloy catalysts. Nat. Chem. 10, \n1008–1015 (2018).\n27. George, S. M. Atomic layer deposition: an overview. Chem. Rev. 110, 111–131 (2010).\n28. Jacobsson, T. J. & Edvinsson, T. Photoelectrochemical determination of the absolute band \nedge positions as a function of particle size for ZnO quantum dots. J. Phys. Chem. C 116, \n15692–15701 (2012).\n29. Xu, H.-Q. et al. Visible-light photoreduction of CO2 in a metal–organic framework: boosting \nelectron–hole separation via electron trap states. J. Am. Chem. Soc. 137, 13440–13443 \n(2015).\n30. Linsebigler, A. L., Lu, G. & Yates, J. T. Jr Photocatalysis on TiO2 surfaces: principles, \nmechanisms, and selected results. Chem. Rev. 95, 735–758 (1995).\n31. Lear, T. et al. The application of infrared spectroscopy to probe the surface morphology \nof alumina-supported palladium catalysts. J. Chem. Phys. 123, 174706 (2005).\n32. Davidson, E. R., Kunze, K. L., Machado, F. B. C. & Chakravorty, S. J. The transition \nmetal-carbonyl bond. Acc. Chem. Res. 26, 628–635 (1993).\n33. Borodziński, A. & Bond, G. C. Selective hydrogenation of ethyne in ethene‐ rich streams on \npalladium catalysts. Part 1. Effect of changes to the catalyst during reaction. Catal. Rev. \nSci. Eng. 48, 91–144 (2006).\nNature | Vol 640 | 17 April 2025 | 67534. Hu, M. et al. 50 ppm of Pd dispersed on Ni(OH)2 nanosheets catalyzing semi-hydrogenation \nof acetylene with high activity and selectivity. Nano Res. 11, 905–912 (2017).\n35. Pei, G. X. et al. Ag alloyed Pd single-atom catalysts for efficient selective hydrogenation of \nacetylene to ethylene in excess ethylene. ACS Catal. 5, 3717–3725 (2015).\n36. Kumar, G., Lau, S. L. J., Krcha, M. D. & Janik, M. J. Correlation of methane activation and \noxide catalyst reducibility and its implications for oxidative coupling. ACS Catal. 6,  \n1812–1821 (2016).\n37. Zhang, W. et al. Size dependence of Pt catalysts for propane dehydrogenation: from \natomically dispersed to nanoparticles. ACS Catal. 10, 12932–12942 (2020).\n38. Gorin, D. J., Sherry, B. D. & Toste, F. D. Ligand effects in homogeneous Au catalysis. Chem. \nRev. 108, 3351–3378 (2008).\n39. Glendening, E. D., Landis, C. R. & Weinhold, F. NBO 7.0: new vistas in localized and \ndelocalized chemical bonding theory. J. Comput. Chem. 40, 2234–2241 (2019).40. Tran, K. & Ulissi, Z. W. Active learning across intermetallics to guide discovery of \nelectrocatalysts for CO2 reduction and H2 evolution. Nat. Catal. 1, 696–703 (2018).\nPublisher’s note Springer Nature remains neutral with regard to jurisdictional claims in \npublished maps and institutional affiliations.\nSpringer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this \narticle under a publishing agreement with the author(s) or other rightsholder(s); author \nself-archiving of the accepted manuscript version of this article is solely governed by the \nterms of such publishing agreement and applicable law.\n© The Author(s), under exclusive licence to Springer Nature Limited 2025, corrected \npublication 2025\nArticleMethods\nPreparation of the SiO2 sphere substrate\nSiO2 spheres were prepared by the Stöber method41. Typically, 17.8 ml \nof ethyl silicate (TEOS), 5.4 ml of NH3·H2O, 360 ml of C2H5OH and 30 ml \nof H2O were added to a 500-ml beaker, and then, the solution mixtures \nwere vigorously stirred at 25 °C for 24 h. Afterwards, the precipitate was \ncentrifuged, washed with ethanol several times and dried at 70 °C over -\nnight. Finally, the SiO2 spheres were obtained by calcination at 800 °C \nunder 10% O2/Ar at a flow rate of 40 ml min−1 for 5 h in a tube furnace.\nPreparation of MgAlxOy and ZnAlxOy spinel supports\nMgAl2Ox spinel support was prepared by the coprecipitation \nmeth od42,43. First, 3.85 g of Mg(NO3)2·6H2O and 11.25 g of Al(NO3)3·9H2O \n(molar ratio of Mg/Al = 0.5) were dissolved in 100 ml of deionized water \nat room temperature. Next, NH3·H2O was added dropwise to the mixed \nsolution to adjust the pH value to 10 ± 0.5. The resulting suspension was \nvigorously stirred for 2 h and aged for another 2 h at 65 °C. After that, \nthe precipitate was filtered, washed several times with deionized water, \nand then dried at 100 °C for 12 h. Finally, the precipitate was calcined \nat 800 °C for 5 h in a static air atmosphere to obtain MgAl2Ox spinel. \nMgAlxOy with different ratios of Al to Mg were achieved by varying the \namounts of Mg(NO3)2·6H2O and Al(NO3)3·9H2O during the synthesis \nprocess. The ZnAlxOy spinel support was synthesized using a similar \nprocedure, except that Mg(NO3)2·6H2O was replaced by Zn(NO3)2·6H2O \n(ref. 44 ).\nPreparation of MOx nanoparticle supports\nMOx particles were fabricated on an SiO2 sphere substrate using ALD, \nwhich was performed in a viscous flow reactor (ALD-V401-PRO, ACME \n(Beijing) Technology) with an ultrahigh purity N2 carrier gas at a flow \nrate of 200 ml min−1 at a base pressure of 0.6 torr. The size of the MOx \nnanoparticles was tuned by varying the number of ALD cycles and \ndeposition temperatures.\nZnO ALD was carried out using DEZ and H2O as precursors. The DEZ \nand H2O precursors were kept at room temperature. The ALD timing \nsequences were 100 s, 400 s, 140 s and 400 s for the DEZ exposure \ntime, N2 purge time, H2O exposure time and N2 purge time, respectively. \nZnO ALD was performed on the SiO2 sphere substrate at 100 °C for 1, \n2 and 3 cycles to obtain the ZnO-1.9 nm, ZnO-2.8 nm and ZnO-4.3 nm \nsamples, respectively. ZnO-8.5 nm was obtained by performing ZnO \nALD for 5 cycles at 150 °C.\nTiO2 ALD was carried out using TTIP and H2O as precursors. The TTIP \nprecursor was heated to 65 °C to obtain sufficient vapour pressure, \nand H2O was kept at room temperature. The ALD timing sequences \nwere 60 s, 300 s, 80 s and 300 s for the TTIP exposure time, N2 purge \ntime, H2O exposure time and N2 purge time, respectively. To obtain the \nTiO2-1.6 nm and TiO2-film samples, TiO2 ALD was performed on the SiO2 \nsphere substrate at 150 °C for 1 and 5 cycles, respectively.\nGa2O3 ALD was carried out using Ga(CH3)3 and H2O as precursors, \nwhich were all kept at room temperature. The ALD timing sequences \nwere 0.01 s, 480 s, 100 s and 480 s for the Ga(CH3)3 exposure time, N2 \npurge time, H2O exposure time and N2 purge time, respectively. To obtain \nthe Ga2O3-1.3 nm and Ga2O3-film samples, Ga2O3 ALD was performed on \nthe SiO2 sphere substrate at 150 °C for 1 and 10 cycles, respectively.\nCoOx ALD was carried out using CoCp2 and O3 as precursors. The \nCoCp2 precursor was heated to 90 °C to obtain a sufficient vapour \npressure. The ALD timing sequences were 200 s, 300 s, 200 s and 300 s \nfor the CoCp2 exposure time, N2 purge time, O3 exposure time and \nN2 purge time, respectively. To obtain the CoOx-1.4 nm, CoOx-1.6 nm, \nCoOx-1.9 nm, CoOx-2.6 nm and CoOx-3.5 nm samples, CoOx ALD was \nperformed on the SiO2 sphere substrate at 200 °C for 1, 3, 5, 10 and 20 \ncycles, respectively.\nNiOx ALD was carried out using NiCp2 and O3 as precursors. The NiCp2 \nprecursor was heated to 90 °C to obtain a sufficient vapour pressure. The ALD timing sequences were 100 s, 300 s, 100 s and 300 s for the \nNiCp2 exposure time, N2 purge time, O3 exposure time and N2 purge \ntime, respectively. To obtain the NiOx-1.8 nm and NiOx-7.1 nm samples, \nNiOx ALD was performed on the SiO2 sphere substrate at 150 °C for 1 \nand 10 cycles, respectively.\nInOx ALD was carried out using In(CH3)3 and H2O as precursors. The \nIn(CH3)3 precursor was heated to 60 °C to obtain a sufficient vapour \npressure, whereas H2O was kept at room temperature. The ALD timing \nsequences were 300 s, 480 s, 300 s and 480 s for the In(CH3)3 exposure \ntime, N2 purge time, H2O exposure time and N2 purge time, respectively. \nTo obtain the InOx-1.3 nm, InOx-4.5 nm and InOx-film samples, InOx ALD \nwas performed on the SiO2 sphere substrate at 150 °C for 1, 5 and 10 \ncycles, respectively.\nPreparation of Pd1/MOx-y nm SACs\nPd1/MOx-y nm SACs were fabricated by depositing Pd exclusively on \nMOx nanoparticles but not on the SiO2 sphere substrate using Pd ALD at \n150 °C in the same ALD reactor using Pd(hfac)2 and formalin as precur -\nsors. The Pd(hfac)2 precursor was heated to 65 °C to obtain a sufficient \nvapour pressure. After temperature stabilization, one cycle of Pd ALD \nwas conducted to prepare the Pd SACs. The ALD timing sequences were \n30 s, 200 s, 30 s and 200 s for the Pd(hfac)2 exposure time, N2 purge \ntime, formalin exposure time and N2 purge time, respectively. The \nresulting samples were denoted as Pd1/MOx-y nm (where y represents \nthe size of MOx). Pd ALD was also carried out on the bare SiO2 spherical \nsubstrate under the same conditions to confirm the selective deposi-\ntion of MOx nanoparticles.\nPreparation of Pd1/MOx-bulk and Pd1/MOx SACs\nThe synthesis of Pd1 single atoms on conventional oxide and sulfide \nsupports was similar to the above procedure of Pd1/MOx-y nm synthesis. \nThe ZrO2, SrTiO3 and Fe2O3 supports were calcined at 800 °C under 10% \nO2/Ar at a flow rate of 40 ml min−1 for 5 h in a tube furnace before Pd ALD. \nThe remaining samples, ZnO-bulk, CoOx-bulk, NiOx-bulk, InOx-bulk, \nMgAlxOy, ZnAlxOy and Fe3O4, were all directly used for Pd ALD without \npretreatment.\nCharacterization\nThe metal loadings of Pd SACs were determined by an inductively \ncoupled plasma atomic emission spectrometer (ICP–AES, iCAP7400, \nThermo Fisher); therein, all the samples were dissolved in hot aqua \nregia. The XRD patterns were measured in the range of 10–80° on an \nX-ray diffractometer (TTR-Ш, Rigaku, Japan) equipped with graphite \nmonochromatized Cu Kα radiation (λ = 1.54,178 Å). AC-HAADF-STEM \nimages were recorded on a JEM ARM200F ( JEOL) thermal-field emis -\nsion microscope with a probe Cs-corrector operating at 200 kV. For the \nHAADF images, a convergence angle of about 23 mrad and a collection \nangle range of about 68–174 mrad were used for incoherent atomic \nnumber imaging. The MOx size distribution was obtained by counting \nmore than 200 MOx nanoparticles from the STEM images at different \nlocations using ImageJ software. The optical absorption and band gap \nenergy of the sample at RT were characterized by an ultraviolet–visible \n(UV–Vis) spectrophotometer (Shimadzu DUV-3700).\nMott–Schottky plot measurements were performed on a Zahner \nZennium electrochemical workstation in a standard three-electrode \nsystem. The catalyst supports (20 mg) were first dispersed into a solu -\ntion of 5 wt% Nafion (10 μl) and ethanol (1 ml). Then, the catalyst support \nsuspension above (30 μl) was dropped onto the surface of the glassy \ncarbon electrode (diameter = 5 mm) to obtain the working electrode. \nA Pt plate was used as the counterelectrode, and Ag/AgCl served as \nthe reference electrode. A 0.1 M Na2SO4 aqueous solution was used as \nthe electrolyte. The frequencies of the Mott–Schottky plot measure -\nments were set as 300 Hz, 500 Hz, 1,000 Hz and 1,500 Hz. The LUMO \nposition of the semiconductor is approximately equal to the flat-band \npotential determined by Mott–Schottky plots Notably, there were \ntrivial structural changes after the Mott–Schottky plot measurements \n(Supplementary Fig. 10).\nIn situ diffuse reflectance infrared Fourier transform spectroscopy \n(DRIFTS) of CO chemisorption was performed on a Nicolet iS10 spec-\ntrometer equipped with a mercury cadmium telluride detector and \na low-temperature reaction chamber (Praying Mantis Harrick). All \nsamples were first reduced at 100 °C in situ for 30 min under 10% H2/\nAr with a flow rate of 20 ml min−1. Then, the sample was cooled to 25 °C \nin Ar, and a background spectrum was taken before the catalyst was \nexposed to 10% CO/Ar at a flow rate of 25 ml min−1 for 20 min until satura -\ntion. Subsequently, the catalyst was purged with pure Ar for 20 min to \nremove the gas phase CO, and the DRIFT spectrum was collected with \n256 scans at a resolution of 4 cm−1.\nX-ray absorption spectroscopy (XAS) at the Pd K-edge (24.35 keV) \nwas performed at the beamline of the Materials Research Collabora -\ntive Access Team at Sector 10 of the Advanced Photon Source, Argonne \nNational Laboratory. The Athena software package was used for the \ndata analysis.\nIn situ XPS experiments were performed on a ThermoFisher instru-\nment (ESCALAB XI+) equipped with a gas cell (Model HPGC 300, Fermi \nInstruments) directly mounted to the sample chamber at the Dalian \nInstitute of Chemical Physics. The spectra were recorded using mono -\nchromated X-ray irradiation with Al Kα (hv = 1,486.7 eV) as the X-ray \nsource. After reduction in 10% H2/Ar (the flow rate was 20 ml min−1 and \nthe total pressure was 1 bar) at 100 °C for 30 min in the high-pressure \ngas cell, the sample was directly transferred to the analysis chamber \nin UHV without exposure to air. All XPS spectra were recorded at room \ntemperature under UHV conditions (about 5 × 10−10 mbar) and cali -\nbrated for the charging effect by considering the C 1s peak at 284.6 eV \nand the Si 2p peak at 103.5 eV.\nUltraviolet photoelectron spectroscopy measurements were per -\nformed in a Thermo Scientific ESCALAB 250Xi instrument using a He \ndischarge lamp (Heι : hv = 21.22 eV). The data were acquired with a −10 eV \nbias during the ultraviolet photoelectron spectroscopy measurements, \nand Au foil (Alfa Aesar, 99.999%) was used as a reference. The work \nfunctions (Ф) and HOMO and LUMO positions of these samples were \ncalculated based on equations (1–3), respectively,\nΦE E =21.22 eV−( −) (1)cutoff F\nEΦ HO MO positi on(versusvacuum level) =− (VB− +) (2)F\nELUMO positi on(versusvacuum level)\n=H OM Op ositio n(versusvacuum level) +(3)\ng\nwhere the Fermi edge (EF) starts at the cut-off of photoemission spectra \nnear zero binding energy. The secondary electron emission cut-off \nenergy (Ecutoff ) was calculated by the extremum in the first-order differ -\nential cut-off region. The valence band edge (VB) was calculated by the \ncrossover point between the tangent of the photoemission spectra and \nthe x-axis45. The band gap (Eg) was determined by UV–Vis spectroscopy.\nTPD of acetylene and H2 was conducted on a Micromeritics Auto -\nChem II chemisorption instrument connected to an online mass spec -\ntrometer (Pfeiffer OmniStar). Before the TPD measurements, all the \nsamples were first reduced at 100 °C for 30 min under 10% H2/Ar at \na flow rate of 20 ml min−1. Next, the sample was cooled to 10 °C in He, \nand C2H2 was introduced to the sample for 30 min to ensure saturated \nadsorption. Subsequently, the sample was purged with He for 1 h to \nremove the weakly bonded and physically adsorbed C2H2 on the sample. \nNext, the sample was gradually heated from 10 °C to 300 °C in He at a \nrate of 10 °C min−1, and the C2H2 signal (m /z = 26) was recorded by mass \nspectrometry. The procedure of H2 TPD was similar to that of C2H2 TPD, \nexcept that C2H2 was replaced by H2 and the temperature range of TPD \nwas changed to 0–500 °C.In  situ thermogravimetric analysis measurements were per -\nformed on a TGA550 instrument (TA Instruments) equipped with an \nevolved gas analysis furnace to quantify coke formation during the \nsemi-hydrogenation of acetylene. The sample was placed in an alumina \ncrucible and heated at a rate of 3 °C min−1 in 10% H2/Ar (20 ml min−1) from \nroom temperature to 100 °C and kept for 30 min. Next, the sample was \npurged with Ar for 15 min before cooling to 80 °C. Then, the acetylene \nhydrogenation reaction gas, consisting of 1% acetylene, 2% H2 and 50% \nethylene with Ar as the balance gas, was introduced to the reactor for \n25 h. The evolution of the sample weight during acetylene hydrogena -\ntion was then recorded.\nCatalyst evaluation\nThe semi-hydrogenation of acetylene in excess ethylene was carried \nout in a fixed-bed quartz tube reactor at atmospheric pressure. The \namounts of Pd1/MOx catalysts were adjusted to maintain the same \nPd content. The sample was diluted with 1.0 g of 60–80 mesh quartz \nchips to avoid any hot spots. Before the reaction test, all catalysts \nwere reduced in situ in 10% H2/Ar at 100 °C for 30 min. Then, reaction \nfeed gas, consisting of 1% acetylene, 2% H2 and 50% ethylene with Ar \nas the balance gas, was introduced into the catalyst bed at a flow rate \nof 20 ml min−1. The reaction products were analysed using an online \ngas chromatograph (Shimadzu GC-2014) equipped with a flame ioni-\nzation detector and a capillary column (Rt-Alumina BOND/Na2SO4, \n50 m × 0.53 mm). The acetylene conversion, ethylene selectivity and \nTOF were calculated using equations ( 4–6), respectively:\n\n\n CH conversi on =[C H] −[CH ]\n[C H]×100% (4)2222 in 22 out\n22 in\n\n\n CH selectivit y= 1−[C H]\n[C H] −[CH ]×100% (5)2426 out\n22 in 22 out\nnTO F=[C H] ×C Hc onversio n\n×100% ×22. 4× 10(6)22 in 22\nPd−3\nHere, [C2H2]in and [C2H2]out are the concentrations of acetylene at \nthe inlet and outlet of the reactor, respectively; [C2H6]out is the con -\ncentration of ethane at the outlet of the reactor; and nPd is the mole \nof Pd content. The molar volume of gas under standard conditions is \n22.4 × 10−3 ml mol−1.\nSelective hydrogenation of 1,3-butadiene was also performed in \na fixed-bed quartz tube reactor at atmospheric pressure. The reac -\ntion feed gas of the acetylene mixture gas was replaced by a mixture \nof 1,3-butadiene gas, which consisted of 1% 1,3-butadiene and 2% H2 \nwith Ar as the balance gas. The 1,3-butadiene conversion and butylene \nselectivity were calculated using equations ( 7) and (8), respectively:\nCH conversi on =[C H] −[CH ]\n[C H]×100% (7)4646 in 46 out\n46 in\n\n\nCH selectivit y= 1−[C H]\n[C H] −[CH ]×100% (8)4841 0o ut\n46 in 46 out\n\n\nHere [C4H6]in and [C4H6]out are the concentrations of 1,3-butadiene \nat the inlet and outlet of the reactor, respectively; [C4H10]out is the con-\ncentration of butane at the outlet of the reactor.\nKinetic measurements\nKinetic measurements were further performed in the same fixed-bed \nreactor. The amount of Pd catalyst was reduced to maintain the acety -\nlene conversion below 20%. The apparent activation energies were \ndetermined on the same reaction system in the temperature range \nArticlebetween 60 °C and 120 °C with the same feed gas composition used for \nacetylene hydrogenation. To measure the H2 reaction order, we kept \nthe concentration of acetylene constant at 1% while changing the H2 \nconcentration from 2% to 9%. To measure the C2H2 reaction order, we \nkept the concentration of H2 constant at 6% while changing the C2H2 \nconcentration from 1% to 3%.\nH–D exchange reaction\nThe H–D exchange reaction was carried out in a fixed-bed quartz tube \nreactor at atmospheric pressure. The catalyst was diluted with 1 g of \nfine quartz chips, and the amount of catalyst was adjusted to keep \nthe H2 conversion below 20%. Before the H–D exchange reaction test, \nthe sample was first reduced in 10% H2/Ar at 100 °C for 30 min. Next, \na feed gas consisting of 10% D2 and 10% H2 with Ar as the balance gas \nwas introduced to the sample at a total flow rate of 20 ml min−1. The \nreaction temperature was varied from 60 °C to 120 °C. The signals \nof H2 (m /z = 2), HD ( m/z = 3) and D2 (m /z = 4) were recorded by online \nmass spectrometry (Pfeiffer OmniStar). The HD exchange activity and \nkinetic data were also calculated in the same way as those for acetylene \nhydrogenation.\nDFT calculations\nAll computations were carried out using the spin-polarized DFT \nmethod implemented in the Vienna ab initio Simulation Package \n(ref. 46 ). The projector-augmented-wave pseudopotential was used \nto treat the core electrons, whereas the Perdew–Burke–Ernzerhof \nexchange-correlation functional of the generalized gradient approxi -\nmation (GGA) was used to describe the electron interactions47–50. Con -\nsidering the systemic error of the GGA functional for describing the \nelectronic structure of transition metal oxides, it is worth noting that \nthe absolute energy level positions of the LUMO mentioned in the arti -\ncle might not be very accurate, whereas the trend of the energy-level \nposition change with size can be informative and is what we are truly \nconcerned with. A plane-wave cut-off energy of 500 eV was adopted for \nall calculations and both lattice constants along the periodic direction \nand atomic positions were optimized with the convergence of energy \nand force less than 10−5 eV and |0.05| eV Å−1, respectively. The van der \nWaals interactions were described using the empirical correction in \nGrimme’s scheme51. The study of charge transfer was completed by \nBader charge analysis52. The adsorption energy of a gas molecule is \ndefined as Eads = Emol* − Emol − E *, where Emol, E* and Emol* are the total \nenergies of the gas molecule, the Pd1 SAC and the adsorbate/SAC \nsystem, respectively. Moreover, the free energies of the reactant, \nproduct and reaction intermediates are defined as G  = EDFT + EZPE − TS, \nwhere EDFT, EZPE and TS represent the DFT-calculated electronic energy, \nzero-point energy and entropy of the system, respectively. The cal -\nculated finite-temperature entropy and zero-point energy (ZPE) are \nlisted in Supplementary Table 12. The climbing image nudged elastic \nband (CI-NEB) method53 was used to calculate the reaction activation \nenergy barriers, with the transition states verified through a rigorous \nvibrational frequency analysis.\nFor the catalyst model, considering the consumption of computing \nresources and experimental characterization results, a series of approx -\nimately pie-shaped ZnO clusters (named ZnO-x , where x  is the number \nof ZnO units in the chemical formula) mainly exposed to the (1010)  \nsurface was constructed to simulate different sizes of support particles. \nThe ZnO-52 support, which has similar sizes to the experimental 1.9 nm \nparticle, was selected as the model for the specific calculation of the \nreaction. The largest support was modelled by a (3 × 2) supercell of a \nseven-atomic-layer ZnO (1010)  surface (named ZnO-slab), and the bot -\ntom three layers of atoms were fixed during optimization. A vacuum \nlayer of more than 15 Å for all the models was used to avoid interactions \nbetween periodically repeated structures. Zinc vacancies on the ZnO \nsurface were selected as the anchor sites for a single Pd atom, as shown \nin Supplementary Table 8.Natural resonance theory analysis was conducted by using the \nNatural Bond Orbital (NBO 7.0) and Gaussian16 program package to \nevaluate the ionicity of surface Pd–O chemical bonds on various oxide \nsupports54–56.\nMicrokinetic simulations\nMicrokinetic simulations were performed by using the MKMCXX \nprogram57,58. The contributions of the elementary steps to the overall \nreaction were determined through the degree of rate control method59. \nFor acetylene hydrogenation to ethylene from 340 K to 370 K on Pd1/\nZnO-52 and Pd1/ZnO-slab, the gas phase contains a mixture of C2H2 \nand H2 in a 1:2 molar ratio at a total pressure of 0.1 MPa, similar to the \nexperimental conditions. For Pd1/ZnO-52, a gas phase with and without \nthe presence of C2H4 (C2H2:H2:C2H4 = 1:2:0 and C2H2:H2:C2H4 = 1:2:10) \nwas adopted to consider the impact of C2H4 on the reaction kinetics. \nThe reaction rates of each elementary reaction were calculated based \non the surface coverages of the steady state. The reaction pathways, \nincluding the dissociation of H2, C2H2* hydrogenation to C2H3*, followed \nby C2H3* to C2H4* and the kick-off of C2H4* by C2H2, were all considered \nin the kinetic calculations.\nData availability\nAll data generated during this study are included in this published \narticle (and Supplementary Information) or can be obtained from \nthe authors upon reasonable request. Source data are provided with \nthis paper.\n \n41. Bourgeat-Lami, E. & Lang, J. Encapsulation of inorganic particles by dispersion \npolymerization in polar media: 2. effect of silica size and concentration on the morphology \nof silica–polystyrene composite particles. J. Colloid Interface Sci. 210, 281–289 (1998).\n42. Guo, J. et al. Dry reforming of methane over nickel catalysts supported on magnesium \naluminate spinels. Appl. Catal. A Gen. 273, 75–82 (2004).\n43. Theofanidis, S. A., Galvita, V. V., Poelman, H. & Marin, G. B. Enhanced carbon-resistant dry \nreforming Fe-Ni catalyst: role of Fe. ACS Catal. 5, 3028–3039 (2015).\n44. Cornu, L., Gaudon, M. & Jubera, V. ZnAl2O4 as a potential sensor: variation of luminescence \nwith thermal history. J. Mater. Chem. C 1, 5419–5428 (2013).\n45. Zhang, J. et al. Deep UV transparent conductive oxide thin films realized through \ndegenerately doped wide-bandgap gallium oxide. Cell Rep. Phys. Sci. 3, 100801  \n(2022).\n46. Kresse, G. & Furthmüller, J. Efficient iterative schemes for ab initio total-energy calculations \nusing a plane-wave basis set. Phys. Rev. B 54, 11169–11186 (1996).\n47. Kresse, G. & Joubert, D. From ultrasoft pseudopotentials to the projector augmented-wave \nmethod. Phys. Rev. B 59, 1758–1775 (1999).\n48. Blöchl, P. E. Projector augmented-wave method. Phys. Rev. B 50, 17953–17979 (1994).\n49. Perdew, J. P., Burke, K. & Ernzerhof, M. Generalized gradient approximation made simple. \nPhys. Rev. Lett. 77, 3865–3868 (1996).\n50. Maintz, S., Deringer, V. L., Tchougréeff, A. L. & Dronskowski, R. Analytic projection from \nplane‐ wave and PAW wavefunctions and application to chemical‐ bonding analysis in \nsolids. J. Comput. Chem. 34, 2557–2567 (2013).\n51. Grimme, S., Ehrlich, S. & Goerigk, L. Effect of the damping function in dispersion corrected \ndensity functional theory. J. Comput. Chem. 32, 1456–1465 (2011).\n52. Henkelman, G., Arnaldsson, A. & Jónsson, H. A fast and robust algorithm for Bader \ndecomposition of charge density. Comp. Mater. Sci. 36, 354–360 (2006).\n53. Henkelman, G., Uberuaga, B. P. & Jónsson, H. A climbing image nudged elastic band \nmethod for finding saddle points and minimum energy paths. J. Chem. Phys. 113,  \n9901–9904 (2000).\n54. Reed, A. E., Curtiss, L. A. & Weinhold, F. Intermolecular interactions from a natural bond \norbital, donor-acceptor viewpoint. Chem. Rev. 88, 899–926 (1988).\n55. Gaussian 16, Revision C.01 (Theoretical Chemistry Institute, Univ. Wisconsin, 2018).\n56. Glendening, E. D. & Weinhold, F. Natural resonance theory: I. General formalism.  \nJ. Comput. Chem. 19, 593–609 (1998).\n57. Filot, I. A. W., van Santen, R. A. & Hensen, E. J. M. The optimally performing Fischer–\nTropsch catalyst. Angew. Chem. Int. Ed. 53, 12746–12750 (2014).\n58. Filot, I. A. W. et al. First-principles-based microkinetics simulations of synthesis gas \nconversion on a stepped rhodium surface. ACS Catal. 5, 5453–5467 (2015).\n59. Stegelmann, C., Andreasen, A. & Campbell, C. T. Degree of rate control: how much the \nenergies of intermediates and transition states control rates. J. Am. Chem. Soc. 131,  \n8077–8082 (2009).\nAcknowledgements This work was supported by the National Key R&D Program of China \n(2021YFA1502802), the Chinese Academy of Sciences (XDA29040800), the National Science \nFund for Distinguished Young Scholars (22025205 and 22225301), the National Science Fund \nof China (22221003, 22073087, 22302200, 22321001 and 22472164), the NSFC Center for \nSingle-Atom Catalysis (22388102), the Fundamental Research Funds for the Central Universities \n(WK2060000038 and 20720220009), the Strategic Priority Research Program of the CAS \n(XDB0450101), K. C. Wong Education (GJTD-2020-15), the CAS Project for Young Scientists in \nBasic Research (YSBR-022 and YSBR-004), the Dalian Institute of Chemical Physics (DICP \nI202107), the Innovation Program for Quantum Science and Technology (2021ZD0303302) \nand the National Science Foundation Graduate Research Fellowship under grant no. 2234662. \nZ.F. also acknowledges the support of the China Experience Fund from Oregon State \nUniversity. XAS experiments were performed at the 10-ID of the Materials Research \nCollaborative Access Team, which is supported by the US Department of Energy (DOE) and  \nthe Materials Research Collaborative Access Team member institutions. This research used the \nresources of the Advanced Photon Source, a US DOE Office of Science User Facility operated \nfor the DOE Office of Science by Argonne National Laboratory under contract no. DE-AC02-\n06CH11357. We also thank J. Yang, J. Liu and L. Feng for their comments and S. Han, L. Xu and \nL. Cai for providing catalytic support.\nAuthor contributions J.L. conceived the project and designed the experiments; X.S., H.W.,  \nJ.D., S.C., W.X. and Y. Li performed the catalytic performance evaluation; X.W., H.L. and Z.W. \nperformed the theoretical calculations; Q.G., X.X., Y. Lin, P.D., T.Z. and B.Y. carried out the  STEM and XPS measurements; M.S. performed the ICP measurements; X.S., L.J. and H.-L.J. \nconducted the Mott–Schottky curve measurements; M.P.L., A.C. and Z.F. carried out the XAS \nmeasurements; J.L., X.S., Q.G., B.Y., X.W. and Z.W. wrote the paper. All the authors contributed \nto the overall scientific interpretation and edited the paper.\nCompeting interests The authors declare no competing interests.\nAdditional information\nSupplementary information The online version contains supplementary material available at \nhttps://doi.org/10.1038/s41586-025-08747-z.\nCorrespondence and requests for materials should be addressed to Bing Yang, Xiaojun Wu or \nJunling Lu.\nPeer review information Nature thanks Thomas Senftle and the other, anonymous, reviewer(s) \nfor their contribution to the peer review of this work. Peer reviewer reports are available.\nReprints and permissions information is available at http://www.nature.com/reprints.",
  "created_at": "2025-08-13T21:15:17.054546"
}