{
  "document_id": 43,
  "original_file_path": "D:\\Trae\\文章总结工具\\backend\\uploads\\ad724d30-0f8e-4a77-af14-d29a043fbf4d.pdf",
  "processed_text": "Nature Catalysis\nnature catalysishttps://doi.org/10.1038/s41929-025-01302-z\nArticle\nElectron and proton storage on separate Ru \nand BaO domains mediated by conductive \nlow-work-function carbon to accelerate \nammonia synthesis\n \nYaejun Baik    1, Seunghyuck Chi1, Kyeongjin Lee    1, DongHwan Oh    1, \nKyungho Lee    2 & Minkee Choi    1 \nAmmonia (NH3) has gained attention as a carbon-free fuel and hydrogen \ncarrier, making its energy-efficient production increasingly important. \nHere we demonstrate that Ru and BaO, connected by conductive carbon, \ncan separately store e− and H+, like a chemical capacitor under NH3 synthesis \nconditions. H atoms generated on the Ru surface by H2 activation polarize \ninto H+/e− pairs. Subsequently, H+ migrates over the carbon surfaces to \nneutralize basic BaO, while e− accumulates in conductive Ru/carbon. As the \nwork function of carbon decreases, Ru gradually becomes enriched with e−, \nfacilitating N2 activation via π-backdonation and alleviating H2 poisoning. \nThus, an optimized catalyst synthesized using N-doped MWNT with the \nlowest work function, exhibited 7.4 times higher activity than a reference \nBa–Ru/MgO catalyst. The results show that charge distribution within \ncatalysts can be markedly altered under reaction conditions, and its rational \ncontrol can enable the design of active NH3 synthesis catalysts.\nAmmonia (NH3) is essential for the production of fertilizers, phar -\nmaceuticals and explosives, and it has recently gained attention as a \ncarbon-free fuel and a hydrogen carrier1,2. Conventional NH3 synthesis \nvia the Haber–Bosch process relies on fossil-derived H2, operates under \nharsh conditions (>723 K, >15 MPa) and necessitates centralized facili -\nties for economic viability3,4. This process contributes over 1.2% of the \nglobal anthropogenic CO2 emissions and incurs additional costs for \ntransportation and distribution3,4. As a more sustainable alternative, \ndecentralized NH3 synthesis coupled with renewable H2 production \nhas garnered scientific attention5,6. To integrate with electrolytic H2 \nproduction and achieve greater economic feasibility, NH3 synthesis \nunder much milder conditions (<573 K, <2 MPa) is desirable6. The major \nchallenge of NH3 synthesis under such conditions lies in activating the \nstable N≡N bonds (945 kJ mol−1) of N2, necessitating the development \nof more advanced catalysts7.Ru catalysts, often supported on MgO (refs. 8 –13) and carbon14–20 in \ncombination with base promoters (for example, Ba, Cs and La oxides), \nhave exhibited high NH3 synthesis activities under mild conditions21. \nConsequently, the base-promoted Ru catalysts were commercialized \nthrough the Kellogg Advanced Ammonia Process in the mid-1990s22. \nThe catalytic effect of base promoters is known to be crucial, often \nincreasing NH3 synthesis activities by an order of magnitude8–12,15 ,16. It \nhas been generally speculated that promoters can influence Ru particle \nsizes to increase the number of active step sites (known as B5 sites)11,18 \nor donate electrons to Ru (refs. 9 ,16). Although the underlying reasons \nremain elusive, the promotional effects vary substantially depend -\ning on the types of supports, loadings of promoters and synthesis \nmethods8–11,13 ,15,16.\nRecently, we elucidated the role of base promoters using \nwell-defined Ba–Ru/MgO catalysts with a fixed Ru dispersion but Received: 21 July 2024\nAccepted: 30 January 2025\nPublished online: xx xx xxxx\n Check for updates\n1Department of Chemical and Biomolecular Engineering (BK21 Four), Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea. \n2Clean Fuel Research Laboratory, Korea Institute of Energy Research, Daejeon, Republic of Korea.  e-mail: mkchoi@kaist.ac.kr\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zwith high NH3 synthesis activity at 573 K and 10 bar, which is 7.4 times \nhigher than a benchmark Ba–Ru/MgO catalyst.\nResults\nSynthesis and characterizations of Ba–Ru/carbon catalysts\nWe used 11 carbon supports after acid washing to remove metal \nimpurities: activated carbon (AC), graphene, graphite, graphitic \ncarbon nanofibre (GNF), single-walled carbon nanotube (SWNT), \ndouble-walled carbon nanotube (DWNT), multiwalled carbon nano -\ntubes with diameters of 10–20 nm (MWNT-1), 20–30 nm (MWNT-2), \n30–50 nm (MWNT-3) and 50–80 nm (MWNT-4), and N-doped MWNT-1 \n(N-MWNT-1). The properties of carbon supports are summarized in \nSupplementary Fig. 1 and Supplementary Table 1. Onto the supports, \n5 wt% Ru was supported by the impregnation of a RuCl3 solution and \nsubsequent reduction in H2 at 673 K. The resulting Ru/carbon catalysts \nwere further impregnated with Ba(NO3)2 and treated in H2 at 673 K to \nproduce Ba–Ru/carbon catalysts, containing ~4.8 wt% Ru with a molar \nBa/Ru ratio of 0.75 (Supplementary Table 2). For comparison, Ru/MgO \nand Ba–Ru/MgO catalysts were also prepared with the same Ru and \nBa contents using the optimized method we previously reported8. \nAccording to transmission electron microscopy (TEM) (Supplemen -\ntary Figs. 2 and 3) and CO chemisorption (Supplementary Table 2), all \ncatalysts contained Ru particles with similar sizes (2.1–2.4 nm). This \ncorresponds to the optimal size distribution of Ru particles (1.8–2.5 nm) \nfor maximizing the number of active B5 sites39–41. Because all catalysts \nhave comparable Ru dispersions, the catalytic effects due to different \nparticle sizes (geometric effects) can be ignored in the subsequent \nexperiments.\nHigh-angle annular dark-field scanning TEM (HAADF-STEM) and \nelemental mapping via energy-dispersive spectroscopy revealed that \nBa–Ru/carbon and Ba–Ru/MgO catalysts have completely different \nlocations and dispersions of BaO. In Ba–Ru/carbon catalysts, island BaO \ndomains larger than 10 nm were predominantly formed and most of the \nsmall Ru particles were not in contact with BaO (Fig. 2a  and Supplemen -\ntary Figs. 4 and 5). Due to the low BaO dispersions, all Ba–Ru/carbon \ncatalysts exhibited strong characteristic peaks for BaO on X-ray diffrac -\ntion (XRD) (Supplementary Fig. 6). By contrast, Ba–Ru/MgO exhibited \nefficient formation of BaO–Ru interfaces (Fig. 2b ); subnanometre BaO \ndomains were primarily located near the Ru particles. Due to the high \nBaO dispersion, this catalyst did not show characteristic peaks for BaO \nin XRD (Supplementary Fig. 6). The distinct dispersion and location \nof basic BaO were further confirmed by temperature-programmed \ndesorption mass spectrometry using acidic CO2 as a probe (CO2 TPD–\nMS). All Ba–Ru/carbon catalysts exhibited a strong peak centred at \n1,000–1,030 K, with a tail extending up to 1,273 K (Fig. 2c ). This peak \ncan be assigned to the desorption of CO2 from the island BaO domains \n(Supplementary Fig. 7), indicating a very strong interaction between \nthe highly basic island BaO domains and acidic CO2. The catalysts also \nexhibited weaker desorption peaks at 700–760 K due to the decom-\nposition of surface carboxyl groups on carbon42. These peaks were \nobserved even without CO2 preadsorption on the catalysts (Supple -\nmentary Fig. 8), and AC with the highest oxygen content gave the largest \npeak. Meanwhile, Ba–Ru/MgO exhibited a major CO2 desorption peak \nat ~600 K (Fig. 2c ), which was assigned to CO2 desorption from the \nBaO–Ru interfaces8.\nTo understand the origin of the different BaO distributions in \nBa–Ru/carbon and Ba–Ru/MgO catalysts, temperature-programmed \nreduction mass spectrometry (TPR–MS) was conducted after impreg -\nnating Ba(NO3)2 onto carbon and MgO supports with and without Ru \n(Fig. 2d). TPR–MS results revealed that Ba(NO3)2 decomposed into BaO \nwith the generation of H2O and NH3 in an H2 atmosphere (Supplemen-\ntary Fig. 9). On both Ru-free carbon and MgO surfaces, thermal decom -\nposition of Ba(NO3)2 occurred at 713–720 K. On Ru/MgO, Ba(NO3)2 \ndecomposition occurred at a lower temperature of 537 K, indicating \nthat Ru can catalyse the decomposition of Ba(NO3)2. As insulating MgO varying interface formation between Ru and BaO (ref. 8 ). Rigorous \nanalyses revealed that BaO donates electrons (e−) to Ru not through \nsimple inductive effects9,16, but rather via a unique mechanism aided by \nH2 under reductive reaction conditions (Fig. 1a). When H2 is activated \non Ru, the resulting H atoms dissociate into H+/e− pairs at the BaO–Ru \ninterfaces. The strongly basic, non-reducible BaO selectively captures \nH+, while leaving e− in Ru. The resulting e− enrichment of Ru facilitates \nN2 activation through enhanced π-backdonation and suppresses H2 \npoisoning, increasing NH3 synthesis activities. Because the insulating \nMgO support prevents the long-range migration of H+/e− pairs (or H \nspillover), such phenomena occur only at the intimate BaO–Ru inter-\nfaces. This implies that enlarging the BaO–Ru interface is necessary \nto achieve high catalytic activity. However, excessive BaO loading also \nresults in blockage of active Ru sites by BaO, causing a trade-off between \nspecific activity and the number of sites8.\nWe hypothesize that the aforementioned trade-off in catalyst \ndesign can be overcome by using conductive supports such as carbon. \nCarbon is known to facilitate the long-range migration of H+/e− pairs \n(or H spillover), with H+ migrating over its surface and e− travelling \nthrough the conduction band23–25. This implies that BaO on carbon \ncan capture H+ even without direct contact with Ru, while leaving e− in \nthe conductive Ru/carbon (Fig. 1b ). This can induce e− enrichment of \nRu without its surface blockage by BaO. Moreover, carbon can have a \nwide range of work functions (4.3–6.5 eV), which vary depending on \nnanostructures and heteroatom doping26–30. If carbon can be designed \nto have a lower work function than Ru (~4.7 eV)31, preferential e− transfer \nfrom carbon to Ru can be further anticipated. Compared with various \nlow-work-function supports used to increase the NH3 synthesis activ -\nity of Ru (for example, electrides32–34, hydrides35,36 and amides37,38), \ncarbon can offer advantages in terms of air stability, material cost and \nproduction scalability.\nIn this study, we demonstrate that Ba–Ru/carbon catalysts can \nexhibit remarkably different NH3 synthesis properties depending on \nthe types of carbon supports, and indeed their work functions govern \nthe overall catalytic properties. Consequently, N-doped multiwalled \ncarbon nanotube with the lowest work function could yield a catalyst \na\nbRu\nBaOH+1H+ storage in BaOπ-backdonation 2\n1e– storage in Rue–e–e–e–\nMgOH\nH spillover1π-backdonation3\n2e– storage in Ru/carbon2H+ storage in BaOH+\nH+\nH\ne–\ne–\ne–e–e–\ne–\ne–\ne–\ne–\ne–\ne–\ne–e–\ne–e–\nBaORuH+H+H+\nH+\nH+\nH+/\ne–\ne–\ne–\ne–\ne–\ne–\ne–\nCarbon\nFig. 1 | Hydrogen-aided electron donation of BaO to Ru during NH3 synthesis.  \na, BaO-promoted Ru catalysts on an insulating MgO support. Chemisorbed H \natoms on Ru polarize into H+/e− pairs at the BaO–Ru interfaces, where non-\nreducible BaO selectively captures H+ while leaving e− in Ru. b , BaO-promoted \nRu catalysts on a conductive carbon support. H+/e− pairs can migrate over long \ndistances across the carbon surface. BaO can capture H+ even without direct \ncontact with Ru, while accumulating e− in the conductive Ru/carbon.\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zdoes not enable H spillover43, 44, the possibility of Ba(NO3)2 decompo -\nsition via H spillover can be excluded. Such Ru-catalysed Ba(NO3)2 \ndecomposition results in the formation of BaO in close proximity to Ru \nparticles8, forming intimate BaO–Ru interfaces (Fig. 2b ). On Ru/carbon \nsurface, Ba(NO3)2 decomposition occurred at further reduced tem -\nperatures (426 K; Fig. 2d). We believe that Ba(NO3)2 could decompose \nat such low temperatures via H spillover, because carbon is a conductive \nmaterial that facilitates H spillover even under mild conditions23–25,45. \nThe Ba(NO3)2 decomposition through H spillover probably generated \nisland BaO domains that were not in contact with Ru particles (Fig. 2a \nand Supplementary Figs. 4 and 5).\nWe also confirmed that using other Ba precursors, such as \nBa(CH3COO)2, and using different solvents for impregnation resulted in \nonly marginal changes in the size and location of BaO domains (Supple -\nmentary Fig. 10). However, simple thermal decomposition of Ba(NO3)2 \nunder He instead of H2 produced markedly larger BaO domains, which \nare catalytically much less effective (Supplementary Fig. 11 and Supple -\nmentary Note 1). These results suggest that the dispersion and location \nof BaO are primarily determined by the decomposition mechanism of \nthe Ba precursors (whether H spillover-assisted or not), rather than by \nthe initial distribution and type of Ba precursor. It appears that H spillo -\nver enhances BaO dispersion on carbon surfaces, probably by increas -\ning the rate of BaO nucleation during Ba precursor decomposition.\nAmmonia synthesis properties of catalysts\nExtensive kinetic studies were conducted on the 22 carbon-supported \nand 2 MgO-supported Ru catalysts (with or without Ba) during NH3 \nsynthesis. Unless specified, high-purity H2 and N2 gases (99.999%) were mixed as the reactant feedstock (<0.4 ppm O2 and <0.7 ppm H2O). For all \nkinetic measurements, reactant conversion levels were kept low (<2%) \nto ensure that the conditions are sufficiently far from thermodynamic \nequilibrium. The NH3 production rates of the catalysts at 573 K and \n1.0 MPa are summarized in Fig. 3a . The catalysts exhibited an extremely \nwide range of NH3 production rates (0.8–342.3 mmol gRu−1 h−1), depend -\ning on the types of support and BaO promotion. This variation is \nremarkable, considering that all catalysts possessed Ru particles with \nsimilar size distributions (2.1–2.4 nm). With both MgO and carbon \nsupports, BaO enhanced NH3 production rates by a factor of 12.5–18.9, \nindicating its notable promoting effects. The NH3 production rates of \nBa–Ru/carbon catalysts varied widely depending on the types of car-\nbon support. The rate increased in the order of graphite < AC < SWNT \n(≈MgO) < DWNT < graphene < GNF ≈ MWNTs. In the case of MWNT \nsupports, the NH3 production rate increased as the diameter of MWNTs \ndecreased (MWNT-4 < MWNT-3 < MWNT-2 < MWNT-1). After N-doping \nonto MWNT-1 (N-MWNT-1), the NH3 production rate increased further. \nConsequently, Ba–Ru/N-MWNT-1 exhibited the highest NH3 production \nrate among all catalysts. Its NH3 production rate (342.3 mmol gRu−1 h–1) \nis 7.4-fold larger than that of Ba–Ru/MgO (46.4 mmol gRu−1 h−1) and sub -\nstantially outperforms other recently reported Ru catalysts under \nvarious reaction conditions (Supplementary Fig. 12 and Supplemen -\ntary Note 2).\nThe catalysts exhibited a considerable variation in apparent activa -\ntion energies (Ea) in the range of 67.3–121 kJ mol−1 (Fig. 3b and Supple-\nmentary Fig. 13). The most active catalyst, Ba–Ru/N-MWNT-1, exhibited \nthe lowest Ea value, while the least active catalyst, Ru/graphite, showed \nthe highest value. Because the N2 dissociation is the rate-determining \n323 523 723 923 1,12302468101214161820CO2 desorption amount (µmol g–1 K–1)\nTemperature (K)373 473 573 673 773 873Intensity (a.u.)\nTemperature (K)Ru Mg Ba Ru Mg BaRuC Ba2 nm\n2 nm10 nm\n10 nma\n10 nm\n10 nmb\n2 nm\n2 nmRuC Bac d\n600 K\nBa–Ru/MgO1,000–1,030 K\nBa–Ru/SWNT\nBa–Ru/DWNT\nBa–Ru/MWNT-1\nBa–Ru/MWNT-2\nBa–Ru/MWNT-3\nBa–Ru/MWNT-4\nBa–Ru/graphene\nBa–Ru/graphiteBa–Ru/N-MWNT-1\nBa–Ru/GNF\nBa–Ru/ACBa(NO3)2 + N-MWNT-1Ba(NO3)2 + MgO\nBa(NO3)2 + Ru/N-MWNT-1Ba(NO3)2 + Ru/MgONH3 (m/z = 15)713 K\n720 K\n537 K\n426 KCO2\nRuBaO\nCarbon\nCO2\nRu\nBaO\nMgOBa(NO3)2\nBaOBa(NO3)2\nCarbonBaO\nMgOThermal decomposition\nThermal decomposition\nRu-catalysed\ndecomposition\nRu\nBaO\nMgOBa(NO3)2\nRuBaOBa(NO3)2H spillover-assisted\ndecomposition\nHH\nH H\nFig. 2 | Synthesis and characterization of Ba–Ru/carbon catalysts. a,b, HAADF-\nSTEM images and elemental mappings of Ba–Ru/N-MWNT-1 (a ) and Ba–Ru/MgO \n(b). c, CO2 TPD–MS profiles of Ba–Ru/carbon and Ba–Ru/MgO catalysts. Before measurement, the samples were pretreated in He at 673 K, adsorbed with CO2 at \n323 K and purged with He at 323 K to remove weakly adsorbed CO2. d, TPR–MS \nprofiles of Ba(NO3)2-impregnated MgO, N-MWNT-1, Ru/MgO and Ru/N-MWNT-1.\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zstep for NH3 synthesis46, lower Ea values indicate more facile N2 activa-\ntion. In addition, more active catalysts exhibited a larger reaction order \nwith respect to the H2 pressure (Fig. 3c  and Supplementary Fig. 14). The \nleast active Ru/graphite exhibited a highly negative order (−1.01), indi -\ncating severe H2 poisoning, whereas the most active Ba–Ru/N-MWNT-1 \nshowed a markedly positive order (0.65). With increasing activity, the \ncatalysts exhibited a monotonically decreasing reaction order for \nN2 pressure (Fig. 3d and Supplementary Fig. 15). Thus, Ru/graphite \nexhibited a reaction order of 1.24, whereas Ba–Ru/N-MWNT-1 showed a \nreaction order of 0.86. In the 14N2–15N2 isotopic exchange experiments, \nmore active catalysts exhibited faster isotopic exchange (Fig. 3e), \nindicating more facile N2 activation. Consequently, Ba–Ru/N-MWNT-1 \nexhibited a 12.3-fold faster exchange rate than Ru/graphite. All these \nresults coherently indicate that active catalysts can effectively activate \nN2 and alleviate hydrogen poisoning. All catalysts showed small nega-\ntive orders for NH3 pressure (−0.19 to −0.18; Supplementary Fig. 16), \nindicating moderate binding of the product NH3 on Ru.\nUnderstanding the catalytic roles of BaO and carbon supports\nTo investigate the possible structural changes of BaO under a \nH2-containing reductive atmosphere (as in NH3 synthesis conditions), \nCO2 TPD–MS, Raman spectroscopy and X-ray photoelectron spectros -\ncopy (XPS) were carried out, both with and without H2 pretreatment at \n673 K. When comparing the CO2 TPD–MS profiles collected after H2 and \nHe pretreatment, all Ba–Ru/carbon catalysts exhibited a substantial reduction in the CO2 desorption peak centred at 1,000–1,030 K after \nH2 pretreatment (Fig. 4a and Supplementary Fig. 17). In the Raman \nspectra, the H2-pretreated catalysts showed newly appearing bands \nat 3,500–3,650 cm–1 (Fig. 4b and Supplementary Fig. 18), which were \nassigned to BaO–H stretching vibrations47. These results suggest that H \natoms produced through H2 activation on Ru can split into H+/e− pairs, \nand the resulting H+ titrates basic BaO to form BaOH surface species8. \nAccording to the Ba 3d  XPS (Fig. 4c and Supplementary Fig. 19), the \noxidation state of Ba remains +2 after H2 pretreatment. This indicates \nthat e− does not transfer to non-reducible BaO, but rather accumu -\nlates in other parts of the catalysts, probably along the conductive \nRu/carbon (Fig. 1b ).\nThese observations were seemingly similar to those we previ -\nously obtained with Ba–Ru/MgO (ref. 8 ). However, a remarkable dif -\nference exists between the carbon- and MgO-based catalyst systems. \nOn the MgO support, the titration of BaO with H+ occurred only at the \nintimate BaO–Ru interfaces, but not in island BaO domains that were \nnot in contact with Ru (ref. 8 ). This can be explained by the fact that \ninsulating MgO prevents the long-range migration of H+/e− pairs (or \nH spillover), thereby making the splitting of H into H+/e− feasible only \nat the BaO–Ru interfaces (Fig. 1a). It is worth recalling that the present \nBa–Ru/carbon catalysts predominantly possessed separated Ru and \nBaO domains, yet still exhibited significant titration of BaO with H+ \nions. This can be attributed to the fact that conductive carbon can \nfacilitate the long-range migration of H+/e− pairs, with H+ moving over \nthe carbon surface and e− travelling through the conduction band23–25.\nTo investigate the e− accumulation in conductive Ru/carbon, the \nelectronic structures of carbon and Ru were analysed using ultraviolet \nphotoelectron spectroscopy (UPS) and XPS. In XPS, an Au film was \nused as an external reference to calibrate the binding energy scale \n(Au 4 f7/2 binding energy of 84.0 eV). The pristine carbon supports \nexhibited work functions ranging from 4.46 to 4.80 eV, with the lowest \nvalue observed for N-MWNT-1 and the highest for graphite (Supple -\nmentary Table 3 and Supplementary Fig. 20). When Ru/carbon and \nBa–Ru/carbon catalysts were pretreated in He, their work functions \nwere almost identical to those of the bare carbon supports (Sup -\nplementary Table 3 and Supplementary Fig. 21). This implies that \nthe effective work function of the catalyst, a composite material, is \ngoverned by its most predominant component48, the carbon support. \nAfter H2 pretreatment, the work functions of Ru/carbon catalysts still \nremained similar to those of the original carbon supports (Fig. 4d, \nSupplementary Table 3 and Supplementary Fig. 22). Notably, when \nBa–Ru/carbon catalysts were pretreated in H2, substantial decreases \nin work functions (0.15–0.18 eV) were observed (Fig. 4d, Supplemen-\ntary Table 3 and Supplementary Fig. 23). The reduced work function \nimplies that the Fermi levels of the catalysts were upshifted due to \nincreased electron density49. The H2-pretreated Ba–Ru/carbon cata -\nlysts also exhibited redshifts in the binding energies of C 1s  (Fig. 4e  \nand Supplementary Fig. 24) and Ru 3d  XPS spectra (Fig. 4f and Sup -\nplementary Fig. 25), confirming increased electron density in carbon \nand Ru, respectively. These results support our hypothesis that H+ is \ncaptured by BaO, while e− accumulates in Ru/carbon in Ba–Ru/carbon \ncatalysts under a reductive atmosphere.\nNotably, Ru became increasingly enriched with e−, showing a \nlarger redshift in the Ru 3d5/2 binding energy, as the work function of \nthe catalysts (governed by that of carbon) decreased (Fig. 4f,g). This \ncan be explained by the fact that carbon supports with lower work \nfunctions than Ru (4.67 eV; Supplementary Fig. 26) efficiently donate \ne− to the Ru particles to align their Fermi levels. It appears that, when \nBaO captures H+, e− accumulates in the conductive Ru/carbon, while \nthe relative distribution of e− between Ru and carbon is determined \nby the difference in their work functions. Among the catalysts, Ba–\nRu/N-MWNT-1 showed the lowest work function after H2 pretreat -\nment (4.28 eV) and, thus, the greatest e− enrichment of Ru. This can be \nattributed to the fact that doping electron-rich nitrogen into a carbon \n0100200300\n6085110Ea (kJ mol–1)\n–1.2–0.7–0.20.30.8\n0.91.01.11.21.3Reaction\norder to N2Reaction\norder to H2\nMgO\nGraphiteAC\nSWNT DWNT\nGraphene MWNT-4 MWNT-3 MWNT-2GNF\nMWNT-1N-MWNT-1015030045014N15N formation\nrate (mmol gRu–1 h–1)a\nb\nc\nd\newith BaO\nwithout BaO\nwithout BaO\nwith BaO\nwith BaO\nwithout BaO\nwithout BaO\nwith BaO\nwith BaO\nwithout BaONH3 production\nrate (mmol gRu–1 h–1)\nFig. 3 | NH3 synthesis properties of the Ru catalysts. a, NH3 production rates \nat 573 K and a total pressure of 1.0 MPa (H2/N2 = 3). Catalytic performance was \nmeasured three times, and the average with standard deviation as error bars is \nshown. b–e, Apparent activation barriers (b ), reaction orders with respect to H2 \npartial pressure (c ), reaction orders with respect to N2 partial pressure (d ) and \n14N2–15N2 isotopic exchange rates (e ) of the Ru catalysts at 573 K. The results for \nMgO-supported Ru catalysts are shown in the green area.\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zframework can effectively lower its work function30. Indeed, our addi -\ntional experiments revealed that the work function of the catalysts \ndecreases and their NH3 synthesis rate increases monotonically with \nincreasing nitrogen doping in the carbon support (Supplementary \nTable 4, Supplementary Figs. 27–29 and Supplementary Note 3). Given \nthat e− enrichment of Ru is essential for activating the N≡N bond of N2 \nvia π-backdonation8,32–35,37, the work function of the carbon support \nturns out to be the most critical descriptor for the NH3 production rates \nof the Ba–Ru/carbon catalysts, regardless of the reaction temperature \nbetween 573 K and 673 K (Fig. 4h and Supplementary Fig. 30). Other \nimportant catalytic properties, such as reaction orders with respect to H2 and N2 pressures (Supplementary Fig. 31) and 14N2–15N2 isotopic \nexchange activity (Supplementary Fig. 32), also showed strong cor -\nrelations with the work functions.\nBaO loading effects and stability of Ba–Ru/N-MWNT-1\nWe also investigated the effects of different BaO loadings on \nRu/N-MWNT-1 (Fig. 5a). As the Ba/Ru ratio increased up to 0.75, the NH3 \nproduction rate increased, but thereafter it plateaued. These results \nindicate that increased BaO loading is helpful in enriching Ru with \ne− under reductive conditions, but there exists a saturation level. This \nbehaviour is markedly different from that of the Ru/MgO system, which \n4.3 4.4 4.5 4.6 4.7 4.8 4.9278.8279.2279.6280.0Ru 3d5/2 binding energy (eV)\nWork function (eV)\n4.3 4.4 4.5 4.6 4.7 4.8 4.90100200300r (mmol gRu–1 h–1)\nWork function (eV)4.2 4.4 4.6 4.8\nWork function (eV)279.0 279.5 280.0\nRu 3d5/2 binding energy (eV)284.3 284.4 284.5\nC 1s binding energy (eV)323 523 723 923 1,12300.51.01.5CO2 desorption amount\n(µmol g–1 K–1)\nTemperature (K)3,450 3,500 3,550 3,600 3,650 3,700\nIntensity (a.u.)Intensity (a.u.)\n800 790 780 770\nBinding energy (eV) Raman shift (cm-1)\nGraphite\nAC\nGrapheneSWNT\nMWNT-4\nN-MWNT-1DWNT\nMWNT-3MWNT-2\nMWNT-1GNFGraphite\nAC\nGrapheneSWNT\nMWNT-4\nN-MWNT-1DWNT\nMWNT-3MWNT-2\nMWNT-1GNFGraphite\nAC\nGrapheneSWNT\nMWNT-4\nN-MWNT-1DWNT\nMWNT-3MWNT-2\nMWNT-1GNFa b c\nd e f g\nhHe pretreatment\nH2 pretreatmentHe pretreatment\nH2 pretreatmentHe pretreatment\nH2 pretreatment\n3,570 cm–1\n3,580 cm–1\n3,620 cm–1795.2 eV779.8 eVBa 3d\nCarbon\nRu/carbon\nBa–Ru/carbonCarbon\nRu/carbon\nBa–Ru/carbonCarbon\nRu/carbon\nBa–Ru/carbon\n–0.15 eV\n–0.16 eV\n–0.16 eV\n–0.16 eV\n–0.16 eV\n–0.16 eV\n–0.17 eV\n–0.17 eV\n–0.18 eV\n–0.18 eV\n–0.18 eV–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.10 eV\n–0.11 eV\n–0.11 eVBa–Ru/MWNT-1Ba–Ru/AC\nRu/N-MWNT-1\nRu/MWNT-3Ru/MWNT-2Ru/grapheneRu/SWNT \nRu/MWNT-4Ru/DWNT\nBa–Ru/DWNTRu/GNF\nRu/AC Ru/graphiteEnergy (eV)Evacuum\nRuCarbonΦWF = 4.67 eVRu/MWNT-1Ba–Ru/graphite\nBa–Ru/N-MWNT-1Ba–Ru/MWNT-2\nBa–Ru/MWNT-3\nBa–Ru/MWNT-4Ba–Ru/SWNT Ba–Ru/GNFBa–Ru/graphene\nEF\nEF\nBa–Ru/N-MWNT-1\nBa–Ru/MWNT-1\nBa–Ru/GNF\nBa–Ru/MWNT-2\nBa–Ru/SWNT Ba–Ru/DWNTBa–Ru/MWNT-4\nBa–Ru/graphene\nRu/N-MWNT-1Ru/MWNT-1Ru/MWNT-2\nRu/MWNT-3\nBa–Ru/MWNT-3\nBa–Ru/AC\nRu/GNFBa–Ru/graphiteRu/grapheneRu/SWNT \nRu/MWNT-4Ru/DWNT\nRu/ACRu/graphiteWith BaOWithout BaOWith BaOWithout BaO\ne––0.25 eV\n–0.15 eV\n–0.10 eV\n–0.25 eV\n–0.25 eV\n–0.50 eV\n–0.95 eV\n–0.90 eV–0.15 eV\nFig. 4 | Separate storage of H+ and e− at BaO and conductive Ru/carbon.   \na–c, CO2 TPD–MS profiles (a ), Raman spectra (b ) and Ba 3d  XPS (c ) of Ba–Ru/N-\nMWNT-1 collected after He and H2 pretreatment at 673 K. d –f, Work functions  \n(d), C 1s  binding energies (e ) and Ru 3d5/2 binding energies (f ) of the carbon \nsupports and supported Ru catalysts measured after H2 pretreatment. The \nsquare symbols represent carbon, the triangles represent Ru/carbon and the \ncircles represent Ba–Ru/carbon samples. g ,h, Ru 3d5/2 binding energies  (g) and NH3 production rates (h ) plotted as a function of the work functions of \nthe catalysts after H2 pretreatment. The triangle symbols represent Ru/carbon \nsamples without BaO, and the circles represent Ba–Ru/carbon samples. The inset \nin g illustrates the electron transfer from low-work-function carbon to high-\nwork-function Ru particles. ΦWF and EF refer to the work function and Fermi level, \nrespectively.\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zexhibited volcano-type behaviour with respect to BaO loading (Fig. 5a). \nAccording to CO chemisorption (Fig. 5b ), increasing BaO loading onto \nRu/MgO monotonically decreased the number of accessible Ru site due \nto surface blockage. Thus, the observed volcano-type behaviour prob -\nably originated from the trade-off between increased specific activity \nand a decreased number of active sites as BaO loading increased. By \ncontrast, increasing BaO loading on Ru/N-MWNT-1 did not reduce the \nnumber of accessible Ru sites (Fig. 5b ) because BaO and Ru formed \nseparate domains on the carbon surface (Fig. 2a).\nIt has been reported that carbon-supported Ru catalysts can suffer \nfrom methanation during NH3 synthesis50. Methanation can result in \nthe permanent loss of carbon support and cause catalyst sintering. In \nthis context, we investigated the long-term stability of the best catalyst, \nBa–Ru/N-MWNT-1 (Ba/Ru = 0.75), in comparison with that of Ba–Ru/\nAC, one of the most widely studied catalysts in the literature14–16,18. \nBa–Ru/N-MWNT-1 exhibited a high and stable NH3 production rate \nover 100 h (Fig. 5c ), while Ba–Ru/AC showed a much lower, rapidly \ndecreasing NH3 production rate. N2 adsorption and elemental analysis \nshowed that the surface area and nitrogen content of Ba–Ru/N-MWNT-1 \nremained unchanged after the reaction (Supplementary Table 5). Ba–\nRu/N-MWNT-1 also exhibited negligible changes in Ru and BaO disper -\nsions, as well as in the work function (Supplementary Fig. 33). These \nresults indicate that Ba–Ru/N-MWNT-1 is thermochemically stable \nduring NH3 synthesis. By contrast, Ba–Ru/AC exhibited a considerable \ndecrease in surface area (Supplementary Table 5) and sintering of Ru \nand BaO (particularly BaO) (Supplementary Fig. 34) due to carbon \ndegradation via methanation (Fig. 5c, inset).\nWe also investigated the long-term stability of Ba–Ru/N-MWNT-1 \nunder harsher reaction conditions (Supplementary Fig. 35). Commer -\ncial reactant feedstocks can contain oxygen impurities (for example, \nO2 and H2O), with oxygen-equivalent concentrations reaching up to \n10 ppm (ref. 51 ). These oxygen impurities can also degrade the carbon \nsupport through the formation of CO and CO2. Given that catalyst \ndeactivation is more severe at elevated temperatures, we tested the \nstability of Ba–Ru/N-MWNT-1 under a flow of a mixture of low-purity \nN2 and H2 gases (99.9%) (<45 ppm O2 and <170 ppm H2O in the reactant \nfeed) at an increased reaction temperature of 673 K for 500 h. Regard -\nless of reactant purity, Ba–Ru/N-MWNT-1 exhibited similar activity \nand excellent stability, without the generation of CH4, CO or CO2. \nThis remarkable stability can be attributed to the high crystallinity \nof N-MWNT (Supplementary Fig. 1), which provides great thermo -\nchemical stability.Conclusions\nThe present results demonstrate that separate Ru and BaO domains, \nwired by conductive carbon supports, can respectively store e− and H+ \nafter H2 activation under NH3 synthesis conditions. These catalysts can \nbe considered chemical capacitors because two differently charged \nspecies, e− and H+, are separately stored by the chemical function of BaO \n(a strong base). The electronic promotion effects of BaO, well recog -\nnized in the literature for a long time, appear not to stem from simple \ninductive effects9,16, but rather from such charge capacitive effects. In \nparticular, low-work-function carbon supports can effectively increase \nthe electron density of the Ru catalyst particles, thereby increasing \nthe overall NH3 production rates. We believe that the development of \nadvanced nanostructured carbon supports with lower work functions \nand higher crystallinity will enable the development of highly active \nand stable base-promoted Ru catalysts for NH3 synthesis.\nMethods\nCatalyst preparation\nAC (Sigma-Aldrich), graphene (RNDKOREA), graphite (Sigma-Aldrich), \nGNF (Carbon Nano-material Technology) and various carbon nano -\ntubes (RNDKOREA), including SWNT, DWNT and multiwalled carbon \nnanotubes with diameters of 10–20 nm (MWNT-1), 20–30 nm (MWNT-\n2), 30–50 nm (MWNT-3) and 50–80 nm (MWNT-4), were purchased. \nThese samples were dispersed in 200 ml of 6 M aqueous HCl solution \nand sonicated for 1 h at room temperature to remove metal impurities. \nTo synthesize N-MWNT-1 with different nitrogen contents, MWNT-1 \nwas treated with NH3 at varying temperatures, both with and without \nHNO3 pretreatment to introduce defect sites. The combination of \nHNO3 pretreatment and lower NH3 treatment temperatures resulted \nin enhanced nitrogen doping (Supplementary Table 4). For the typi -\ncal synthesis of N-MWNT-1, 1 g of MWNT-1 was first oxidized in 100 ml \nof HNO3 (60%, Samchun) at 373 K for 2 h. The resulting sample was \ncollected by filtration, thoroughly washed with deionized water and \ndried at 373 K overnight. Subsequently, the sample was heated to 973 K \n(ramp: 5 K min−1) in NH3 flow (100 ml min−1) and held for 2 h.\nRu was loaded onto the carbon supports via a wet impregnation \nmethod to achieve a nominal Ru loading of 5 wt%. Typically, 1 g of \ncarbon was dispersed in a solution containing 40 g of acetone (99.5%, \nSigma-Aldrich) and 0.14 g of RuCl3·3H2O (99.9%, Sigma-Aldrich). Ace-\ntone was evaporated at 303 K under vacuum. The resultant powder \nwas further dried overnight at 323 K and subsequently reduced under \nH2 flow at 673 K for 2 h (ramp: 2 K min−1). To prepare Ba–Ru/carbon 0 20 40 60 80 100060300360\nTime (h)0 0.5 1.0 1.5 2.0060120180240300360r (mmol gRu–1 h–1)\nr (mmol gRu–1 h–1)\nBa/Ru ratio0 0.5 1.0 1.5 2.00.20.30.40.5CO/Ru ratio\nBa/Ru ratio020 40 60 8010001234CH4 evolution amount\n(µmol g–1 h–1)\nTime (h)Ba–Ru/N-MWNT-1\nBa–Ru/MgOBa–Ru/AC\nBa–Ru/ACBa–Ru/N-MWNT-1\nBa–Ru/N-MWNT-1\nBa–Ru/N-MWNT-1a b c\nBa–Ru/MgO\nFig. 5 | Effects of BaO loading and long-term catalyst stability. a, Effects of BaO \nloading onto Ru/N-MWNT-1 and Ru/MgO on the NH3 production rate at 573 K \nand 1.0 MPa. b , CO chemisorption on Ru/N-MWNT-1 and Ru/MgO catalysts with different BaO loadings. c , Long-term stabilities of Ba–Ru/N-MWNT-1 and Ba–Ru/\nAC, and methane formation during the NH3 synthesis reaction. Both catalysts \nhave a molar Ba/Ru ratio of 0.75.\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zsamples, 1.0 g of the prepared Ru/carbon samples was additionally \nimpregnated with 0.10 g of Ba(NO3)2 (99%, Sigma-Aldrich) dissolved in \n0.055–1.5 g of deionized water and dried at 373 K to achieve a nominal \nBa/Ru molar ratio of 0.75. Then, the samples were heated to 673 K for \n2 h (ramp: 2 K min−1) under H2 flow.\nFor comparison, Ru/MgO and Ba–Ru/MgO samples were prepared \nusing the optimized method we previously reported8. To synthesize Ru/\nMgO (ref. 8 ), 3.5 g of MgO (95%, Ducksan) and 0.22 g of NaOH (98%, Dae -\njung) were mixed with 120 g of deionized water. A solution containing \n0.48 g of RuCl3·3H2O (99.9%, Sigma-Aldrich) in 20 g of deionized water \nwas then added dropwise to the mixture while stirring vigorously. The \nmixture was hydrothermally treated in a Teflon-lined stainless-steel \nautoclave at 433 K for 24 h under tumbling (30 rpm). The solid product \nwas recovered by filtration and thoroughly washed with deionized \nwater. The recovered sample was dried at 373 K for 12 h, calcined in \ndry air at 773 K for 2 h (ramp: 2 K min−1) and reduced in H2 at 773 K for \n2 h (ramp: 2 K min−1). To synthesize Ba–Ru/MgO (ref. 8 ), 1.0 g of Ru/\nMgO was impregnated with 0.10 g of Ba(NO3)2 (99%, Sigma-Aldrich) \ndissolved in 0.70 g of deionized water and dried at 373 K to achieve a \nnominal Ba/Ru molar ratio of 0.75. The dried sample was then reduced \nat 773 K for 2 h (ramp: 2 K min−1) under humid H2 (4.24 kPa H2O in H2).\nCharacterization\nThe elemental compositions of the carbon supports (H, O and N) were \ndetermined by elemental analysis using a FLASH 2000 (Thermo Sci -\nentific) after thorough evacuation at 673 K for 2 h. The metal impurity \ncontents of carbon supports (Fe, Co and Ni), as well as the Ru and Ba \ncontents of the catalysts, were determined by inductively coupled \nplasma optical emission spectroscopy using an ICP-OES 720 instru -\nment (Agilent). N2 adsorption–desorption isotherms were measured \nusing a Belsorp-Max (BEL Japan) adsorption analyser at 77 K after \nvacuum degassing at 673 K. The Brunauer–Emmett–Teller surface \nareas were determined in the P/P0 range of 0.05–0.15 (P and P0 refer to \nthe pressure and saturated vapor pressure of N2 at 77 K, respectively). \nCO chemisorption was carried out using an ASAP 2020 instrument \n(Micromeritics). Before analysis, all catalysts were reduced in H2 at \n673 K for 3 h, followed by evacuation for 3 h at the same temperature. \nCO chemisorption was conducted at 323 K within a pressure range of \n0.3–60 kPa. After the initial adsorption measurement, the samples \nwere evacuated at 323 K for 1 h and the second isotherm was measured. \nThe quantity of chemisorbed CO was determined by calculating the \ndifference between the first and second adsorption isotherms. TEM, \nHAADF-STEM and elemental mapping via energy-dispersive spec -\ntroscopy were performed using a Titan Cubed G2 60-300 microscope \noperating at 300 kV (KAIST Analysis Center for Research Advance -\nment, KARA), after mounting the samples on a carbon-coated copper \ngrid (300 mesh) using an ethanolic dispersion. To determine the size \ndistribution of Ru particles, at least 300 particles were counted. The \nsurface-weighted mean particle size was calculated using\ndTEM=∑nidi3\n∑nidi2, (1)\nwhere ni represents the number of crystallites with a diameter of di.\nPowder XRD patterns were recorded using a D2-Phaser diffrac -\ntometer (Bruker) equipped with a Cu Kα radiation source (30 kV and \n10 mA) and an LYNXEYE detector. CO2 TPD–MS profiles were collected \nusing a BELMASS II (BEL Japan). Typically, 0.03 g of sieved particles \n(200–300 μm) were pretreated with He or H2 flow (30 ml min−1) at 673 K \nfor 2 h and cooled to 323 K. CO2 was then flowed (30 ml min−1) at 323 K \nfor 1 h, and weakly bound CO2 was desorbed by He purging for 1 h at \nthe same temperature. CO2 TPD–MS profiles were measured from 323 \nto 1,273 K with a ramp rate of 10 K min−1 under He flow (30 ml min−1). \nThe desorbed CO2 signal was identified by the mass signal at m/z = 44. \nTPR–MS was conducted in a quartz plug flow reactor (inner diameter 10.5 mm) connected to an OmniStar GSD 320 quadrupole mass spec-\ntrometer (Pfeiffer Vacuum). Before the experiments, 0.1 g of sieved \nsample particles (200–300 μm) was loaded into the reactor and purged \nwith He at 373 K for 1 h. Then, TPR–MS profiles were measured from \n373 K to 873 K with a ramp rate of 2 K min−1 under H2 flow (50 ml min−1). \nThe desorbed H2O, NH3, NOx (N2O, NO and NO2) and N2 signals were \nidentified by the mass signal at m/z = 18, 15, 30 and 28, respectively.\nRaman spectra were recorded using an ARAMIS (Horiba Jobin \nYvon) with an Ar ion laser (514 nm). Before the analysis, all samples were \nloaded into sample chamber and pretreated in He or H2 at 673 K for 2 h. \nXPS was carried out using Axis-Supra (Kratos) equipped with a mono -\nchromatic Al Kα radiation source (1,486.7 eV). All samples were ana -\nlysed without using a charge neutralizer owing to their high electrical \nconductivity. The energy calibration of spectrometer was conducted \nusing an Au reference film (Au 4f7/2 binding energy of 84.0 eV). UPS \nwas conducted using an Axis-Supra (Kratos) with a He I photon source \n(21.22 eV). The work functions were determined from the secondary \nelectron cut-off energies (Ecut-off ) in the UPS spectra using\nwork function =hν(He I photon energy )−Ecut-off. (2)\nBefore the XPS and UPS analysis, all samples were pretreated in He \nor H2 at 673 K for 2 h and placed in a sample holder inside a glovebox \n(O2 < 1.0 ppm, H2O < 1.0 ppm). The sample holder was moved directly \nfrom the glovebox to the connected analysis chamber without air \ncontact.\n14N2–15N2 isotopic exchange was conducted in a quartz plug flow \nreactor (inner diameter 10.5 mm) connected to the OmniStar GSD 320 \nquadrupole mass spectrometer (Pfeiffer Vacuum). Typically, 0.3 g of \nsieved particles (200–300 μm) was loaded into the reactor, reduced \nat 673 K in H2 for 2 h and then purged with He for 2 h at the same tem-\nperature. After cooling to 573 K under He flow, 14N2–15N2 mixture (10 kPa \n14N2/10 kPa 15N2/80 kPa He) was introduced into the reactor at a flow \nrate of 100 ml min−1.\nCatalytic measurements\nNH3 synthesis was conducted in an Inconel plug flow reactor (inner \ndiameter 10.9 mm). Unless specified, high-purity H2 and N2 gases \n(99.999%) were mixed at an H2/N2 ratio of 3 (<0.4 ppm O2 and <0.7 ppm \nH2O) and used as reactant feedstock. NH3 production was monitored \nusing a gas chromatograph equipped with a thermal conductivity \ndetector and Porapak N (10 ft × 1/8 in × 2.1 mm) and Mol Sieve 5 A \n(6 ft × 1/8 in × 2.1 mm) columns. Typically, 0.10–4.85 g of sieved cata -\nlysts (200–300 μm) was loaded into the reactor and pretreated in H2 at \n673 K for 2 h. After pretreatment, the reactor was adjusted to the target \ntemperature (573–673 K) and pressurized to 1.0 MPa under a flow of the \nH2/N2 mixture. For all kinetic measurements, reactant conversion levels \nwere kept low (<2%) to ensure that the conditions remained sufficiently \nfar from thermodynamic equilibrium (equilibrium conversions are \n25% and 7.1% at 573 K and 673 K, respectively, at 1.0 MPa). Apparent \nactivation energies were determined within the temperature range \nof 573–673 K, and the temperature-dependent NH3 synthesis rates \nwere measured three times for each catalyst. To analyse the reaction \norders with respect to H2 and N2, a series of reactions were performed \nat 0.33–0.67 MPa of H2 and 0.25–0.50 MPa of N2, while maintaining the \ntotal pressure at 1.0 MPa with a He balance at 573 K. The reaction order \nfor NH3 was determined in an H2/N2 mixture (H2/N2 = 3) by varying the \ntotal gas flow rate (F , space velocity: 825–42,700 ml g−1 h−1) at 573 K and \na total pressure of 1.0 MPa.\nThe long-term catalyst stabilities of Ba–Ru/N-MWNT-1 and Ba–Ru/\nAC were tested for 100 h during the NH3 synthesis reaction at 573 K and \n1.0 MPa (H2/N2 molar ratio of 3). During the reaction, the signal for CH4 \nevolution was monitored using the OmniStar GSD 320 quadrupole mass \nspectrometer (Pfeiffer Vacuum) connected to the reactor. The CH4 \nevolution was identified by the mass signal at m/z = 13. The long-term \nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-zstability of Ba–Ru/N-MWNT-1 was additionally investigated under \nharsher reaction conditions. The stability of Ba–Ru/N-MWNT-1 was \ntested under a flow of a mixture of low-purity (99.9%) N2 and H2 gases \n(H2/N2 = 3; <45 ppm O2 and <170 ppm H2O in the reactant feed) at an \nincreased reaction temperature of 673 K for 500 h. During the reaction, \nthe mass signals for CH4, CO and CO2 (m/z = 13, 12 and 44, respectively) \nwere monitored.\nData availability\nThe source data for the figures are available via Zenodo at https://doi.\norg/10.5281/zenodo.14636271 (ref. 52 ). All other data are available from \nthe corresponding author upon reasonable request.\nReferences\n1. Erisman, J. W., Sutton, M. A., Galloway, J., Klimont, Z. & Winiwarter, \nW. How a century of ammonia synthesis changed the world. Nat. \nGeosci. 1, 636–639 (2008).\n2. Wan, Z., Tao, Y., Shao, J., Zhang, Y. & You, H. Ammonia as an \neffective hydrogen carrier and a clean fuel for solid oxide fuel \ncells. Energy Convers. Manag. 228, 113729 (2021).\n3. Wang, M. et al. Can sustainable ammonia synthesis pathways \ncompete with fossil-fuel based Haber–Bosch processes?  \nEnergy Environ. Sci. 14, 2535–2548 (2021).\n4. Smith, C., Hill, A. K. & Torrente-Murciano, L. Current and future \nrole of Haber–Bosch ammonia in a carbon-free energy landscape. \nEnergy Environ. Sci. 13, 331–344 (2020).\n5. Ye, D. & Tsang, S. C. E. Prospects and challenges of green \nammonia synthesis. Nat. Synth. 2, 612–623 (2023).\n6. Ye, L., Nayak-Luke, R., Banares-Alcantara, R. & Tsang, E. Reaction: \n‘Green’ ammonia production. Chem 3, 712–714 (2017).\n7. Fang, H. et al. Challenges and opportunities of Ru-based catalysts \ntoward the synthesis and utilization of ammonia. ACS Catal. 12, \n3938–3954 (2022).\n8. Baik, Y. et al. Splitting of hydrogen atoms into proton–electron \npairs at BaO–Ru interfaces for promoting ammonia synthesis \nunder mild conditions. J. Am. Chem. Soc. 145, 11364–11374 (2023).\n9. Aika, K. I., Takano, T. & Murata, S. Preparation and characterization \nof chlorine-free ruthenium catalysts and the promoter effect in \nammonia synthesis: 3. A magnesia-supported ruthenium catalyst. \nJ. Catal. 136, 126–140 (1992).\n10. Bielawa, H., Hinrichsen, O., Birkner, A. & Muhler, M. The ammonia‐\nsynthesis catalyst of the next generation: barium‐ promoted oxide‐\nsupported ruthenium. Angew. Chem. Int. Ed. 40, 1061–1063 (2001).\n11. Szmigiel, D. et al. The kinetics of ammonia synthesis over \nruthenium-based catalysts: the role of barium and cesium. J. \nCatal.  205, 205–212 (2002).\n12. Siporin, S. E. & Davis, R. J. Use of kinetic models to explore the \nrole of base promoters on Ru/MgO ammonia synthesis catalysts. \nJ. Catal. 225, 359–368 (2004).\n13. Wu, S. et al. Removal of hydrogen poisoning by electrostatically \npolar MgO support for low-pressure NH3 synthesis at a high rate \nover the Ru catalyst. ACS Catal. 10, 5614–5622 (2020).\n14. Raróg, W., Kowalczyk, Z., Sentek, J., Składanowski, D. & Zieliński, \nJ. Effect of K, Cs and Ba on the kinetics of NH3 synthesis over \ncarbon-based ruthenium catalysts. Catal. Lett. 68, 163–168 \n(2000).\n15. Liang, C., Wei, Z., Xin, Q. & Li, C. Ammonia synthesis over Ru/C \ncatalysts with different carbon supports promoted by barium and \npotassium compounds. Appl. Catal. A 208, 193–201 (2001).\n16. Rossetti, I., Pernicone, N. & Forni, L. Promoters effect in Ru/C \nammonia synthesis catalyst. Appl. Catal. A 208, 271–278 (2001).\n17. Zheng, X., Zhang, S., Xu, J. & Wei, K. Effect of thermal and \noxidative treatments of activated carbon on its surface structure \nand suitability as a support for barium-promoted ruthenium in \nammonia synthesis catalysts. Carbon 40, 2597–2603 (2002).18. Guraya, M. et al. The effect of promoters on the electronic \nstructure of ruthenium catalysts supported on carbon.  \nAppl. Surf. Sci. 238, 77–81 (2004).\n19. Chen, S. Y. et al. Ammonia synthesis over cesium-promoted \nmesoporous-carbon-supported ruthenium catalysts: impact of \ngraphitization degree of the carbon support. Appl. Catal. B 346, \n123725 (2024).\n20. Nishi, M. et al. A super-growth carbon nanotubes-supported, \nCs-promoted Ru catalyst for 0.1–8 MPaG ammonia synthesis.  \nJ. Catal. 413, 623–635 (2022).\n21. Schlögl, R. Catalytic synthesis of ammonia—a ‘never‐ ending \nstory’? Angew. Chem. Int. Ed. 42, 2004–2008 (2003).\n22. Strait, R. Grassroots success with KAAP. Nitrogen Methanol 238, \n37–43 (1999).\n23. Keren, E. & Soffer, A. Simultaneous electronic and ionic surface \nconduction of catalyst supports: a general mechanism for \nspillover: the role of water in the Pd-catalyzed hydrogenation of a \ncarbon surface. J. Catal. 50, 43–55 (1977).\n24. Warczinski, L. & Hättig, C. How nitrogen doping affects hydrogen \nspillover on carbon-supported Pd nanoparticles: new insights \nfrom DFT. J. Phys. Chem. C 125, 9020–9031 (2021).\n25. Lee, K. et al. Engineering nanoscale H supply chain to accelerate \nmethanol synthesis on ZnZrOx. Nat. Commun. 14, 819 (2023).\n26. Ago, H. et al. Work functions and surface functional groups of \nmultiwall carbon nanotubes. J. Phys. Chem. B 103, 8116–8121 \n(1999).\n27. Shiraishi, M. & Ata, M. Work function of carbon nanotubes.  \nCarbon 39, 1913–1917 (2001).\n28. Lin, Y. et al. Insights into the surface chemistry and electronic \nproperties of sp2 and sp3-hybridized nanocarbon materials for \ncatalysis. Chem. Commun. 53, 4834–4837 (2017).\n29. Rut’kov, E. V., Afanas’ eva, E. Y. & Gall, N. R. Graphene and graphite \nwork function depending on layer number on Re. Diam. Relat. \nMater. 101, 107576 (2020).\n30. Hwang, S. K. et al. Flexible multilevel resistive memory with \ncontrolled charge trap B-and N-doped carbon nanotubes.  \nNano Lett. 12, 2217–2221 (2012).\n31. Michaelson, H. B. The work function of the elements and its \nperiodicity. J. Appl. Phys. 48, 4729–4733 (1977).\n32. Kitano, M. et al. Ammonia synthesis using a stable electride as \nan electron donor and reversible hydrogen store. Nat. Chem. 4, \n934–940 (2012).\n33. Gong, Y. et al. Unique catalytic mechanism for Ru-loaded ternary \nintermetallic electrides for ammonia synthesis. J. Am. Chem. Soc.  \n144, 8683–8692 (2022).\n34. Li, J. et al. Barium oxynitride electride as highly enhanced \npromotor for ruthenium catalyst in ammonia synthesis: \ncomparative study with barium oxide. Adv. Energy Mater. 13, \n2302424 (2023).\n35. Kitano, M. et al. Essential role of hydride ion in ruthenium-based \nammonia synthesis catalysts. Chem. Sci. 7, 4036–4043 (2016).\n36. Ooya, K. et al. Ruthenium catalysts promoted by lanthanide \noxyhydrides with high hydride‐ ion mobility for low‐ temperature \nammonia synthesis. Adv. Energy Mater. 11, 2003723 (2021).\n37. Inoue, Y. et al. Efficient and stable ammonia synthesis by \nself-organized flat Ru nanoparticles on calcium amide. ACS Catal.  \n6, 7577–7584 (2016).\n38. Kitano, M. et al. Self‐ organized ruthenium–barium core–shell \nnanoparticles on a mesoporous calcium amide matrix for efficient \nlow ‐temperature ammonia synthesis. Angew. Chem. Int. Ed. 57, \n2648–2652 (2018).\n39. Dahl, S. et al. Role of steps in N2 activation on Ru (0001). Phys. Rev. \nLett. 83, 1814–1817 (1999).\n40. Jacobsen, C. J. et al. Structure sensitivity of supported ruthenium \ncatalysts for ammonia synthesis. J. Mol. Catal. A 163, 19–26 (2000).\nNature Catalysis\nArticle https://doi.org/10.1038/s41929-025-01302-z41. Honkala, K. et al. Ammonia synthesis from first-principles \ncalculations. Science 307, 555–558 (2005).\n42. Szymański, G. S., Karpiński, Z., Biniak, S. & Świa  ̧tkowski, A. The \neffect of the gradual thermal decomposition of surface oxygen \nspecies on the chemical and catalytic properties of oxidized \nactivated carbon. Carbon 40, 2627–2639 (2002).\n43. Prins, R. Hydrogen spillover. Facts and fiction. Chem. Rev. 112, \n2714–2738 (2012).\n44. Lee, S., Kim, H., Ryoo, R., Park, J. Y. & Choi, M. Hydrogen spillover \nin nonreducible oxides: mechanism and catalytic utilization.  \nNano Res. 15, 10357–10365 (2022).\n45. Srinivas, S. T. & Rao, P. K. Direct observation of hydrogen \nspillover on carbon-supported platinum and its influence on the \nhydrogenation of benzene. J. Catal. 148, 470–477 (1994).\n46. Hinrichsen, O., Rosowski, F., Muhler, M. & Ertl, G. The \nmicrokinetics of ammonia synthesis catalyzed by \ncesium-promoted supported ruthenium. Chem. Eng. Sci. 51, \n1683–1690 (1996).\n47. Lutz, H. D., Eckers, W., Schneider, G. & Haeuseler, H. Raman \nand infrared spectra of barium and strontium hydroxides and \nhydroxide hydrates. Spectrochim. Acta A 37, 561–567 (1981).\n48. Freeouf, J. L. & Woodall, J. M. Schottky barriers: an effective work \nfunction model. Appl. Phys. Lett. 39, 727–729 (1981).\n49. Kanbara, S. et al. Mechanism switching of ammonia synthesis \nover Ru-loaded electride catalyst at metal–insulator transition.  \nJ. Am. Chem. Soc. 137, 14517–14524 (2015).\n50. Tsyrul’nikov, P. G., Iost, K. N., Shitova, N. B. & Temerev, V. L. \nMethanation of the carbon supports of ruthenium ammonia \nsynthesis catalysts: a review. Catal. Ind. 8, 341–347 (2016).\n51. Attari Moghaddam, A. & Krewer, U. Poisoning of ammonia \nsynthesis catalyst considering off-design feed compositions. \nCatalysts 10, 1225 (2020).\n52. Baik, Y. et al. Electron and proton storage on separate Ru and BaO \ndomains mediated by conductive low-work-function carbon to \naccelerate ammonia synthesis. Zenodo https://doi.org/10.5281/\nzenodo.14636271 (2025).\nAcknowledgements\nThis work was conducted under the framework of the research and \ndevelopment programme of the Korea Institute of Energy Research (grant number C4-2401, M.C.) and supported by the National Research \nFoundation of Korea (grant numbers RS-2024-00333937 and RS-2024-\n00405261, M.C.).\nAuthor contributions\nM.C. conceived and designed this study. Y.B., S.C., Kyeongjin Lee, D.O. \nand Kyungho Lee prepared the materials, performed structural and \ncatalytic characterization, and analysed the experimental results. Y.B. \nand M.C. wrote the paper.\nCompeting interests\nThe authors declare no competing interests.\nAdditional information\nSupplementary information The online version contains \nsupplementary material available at  \nhttps://doi.org/10.1038/s41929-025-01302-z.\nCorrespondence and requests for materials should be addressed to \nMinkee Choi.\nPeer review information Nature Catalysis thanks Chia-Min Yang and \nthe other, anonymous, reviewer(s) for their contribution to the peer \nreview of this work.\nReprints and permissions information is available at  \nwww.nature.com/reprints.\nPublisher’s note Springer Nature remains neutral with regard to \njurisdictional claims in published maps and institutional affiliations.\nSpringer Nature or its licensor (e.g. a society or other partner)  \nholds exclusive rights to this article under a publishing  \nagreement with the author(s) or other rightsholder(s); author \nself-archiving of the accepted manuscript version of this article  \nis solely governed by the terms of such publishing agreement and \napplicable law.\n© The Author(s), under exclusive licence to Springer Nature Limited \n2025",
  "created_at": "2025-04-16T15:42:34.406854"
}